laurencedv/PIClib/lib/peripheral/pic32_interrupt.h
/*!
 @file		pic32_interrupts.h
 @brief		Interrupt lib for pic32

 @version	0.3.0
 @note		Use the name in the Interrupts Source List to access an interrupt with any macro
		Use the Vector number in the _ISR Macro wherever you want
		Use the IRQ only with the run-time functions
 @todo		Test usefulness and exactness of IRQ number for group selection (only pic32mx1xx and 2xx for now)

 @date		September 15th 2012
 @author	Laurence DV
*/


// ########### Interrupts Sources List ########## //
// You must add "INT_" before any of those name (ex: INT_CORE_TIMER)
// Use those to specified which interrupt you want as $intSource in any macro

// -- Individual interrupt -- //
// Core : CORE_TIMER | CORE_SOFT_0 | CORE_SOFT_1
// External Interrupt : EXT_INT_0 | EXT_INT_1 | EXT_INT_2 | EXT_INT_3 | EXT_INT_4
// Input Capture : INPUT_CAPTURE_1 | INPUT_CAPTURE_1_ERR | INPUT_CAPTURE_2 | INPUT_CAPTURE_2_ERR | INPUT_CAPTURE_3 | INPUT_CAPTURE_3_ERR | INPUT_CAPTURE_4 | INPUT_CAPTURE_4_ERR | INPUT_CAPTURE_5 | INPUT_CAPTURE_5_ERR
// Output Compare : OUTPUT_COMPARE_1 | OUTPUT_COMPARE_2 | OUTPUT_COMPARE_3 | OUTPUT_COMPARE_4 | OUTPUT_COMPARE_5
// Timer : TIMER_1 | TIMER_2 | TIMER_3 | TIMER_4 | TIMER_5
// Input Change : INPUT_CHANGE | INPUT_CHANGE_PORT_A | INPUT_CHANGE_PORT_B | INPUT_CHANGE_PORT_C
// ADC : ADC_1
// Fail Safe Clock Monitor : FAIL_SAFE_CLOCK_MON
// Real-time Clock and Calendar : RTCC
// Flash Control Event : FLASH_CONTROL_EVENT
// Comparator : COMPARATOR_1 | COMPARATOR_2 | COMPARATOR_3
// USB : USB
// PMP : PMP | PMP_ERR
// UART : UART_1_ERR | UART_1_RX | UART_1_TX | UART_2_ERR | UART_2_RX | UART_2_TX | UART_3_ERR | UART_3_RX | UART_3_TX | UART_4_ERR | UART_4_RX | UART_4_TX | UART_5_ERR | UART_5_RX | UART_5_TX | UART_6_ERR | UART_6_RX | UART_6_TX
// SPI : SPI_1_ERR | SPI_1_RX | SPI_1_TX | SPI_2_ERR | SPI_2_RX | SPI_2_TX | SPI_3_ERR | SPI_3_RX | SPI_3_TX | SPI_4_ERR | SPI_4_RX | SPI_4_TX
// I2C : I2C_1_COL | I2C_1_SLAVE | I2C_1_MASTER | I2C_2_COL | I2C_2_SLAVE | I2C_2_MASTER | I2C_3_COL | I2C_3_SLAVE | I2C_3_MASTER | I2C_4_COL | I2C_4_SLAVE | I2C_4_MASTER | I2C_5_COL | I2C_5_SLAVE | I2C_5_MASTER
// Ethernet : ETHERNET
// CAN : CAN_1 | CAN_2
// DMA : DMA_0 | DMA_1 | DMA_2 | DMA_3 | DMA_4 | DMA_5 | DMA_6 | DMA_7
// -------------------------- //

//Those special group access control all the relevant interrupt of a peripheral (ex: UART_1 contain UART_1_ERR and UART_1_RX and UART_1_TX)
// -- Group interrupt -- //
// Timer : TIMER_23 | TIMER_45
// Input Change : INPUT_CHANGE
// UART : UART_1 | UART_2 | UART_3 | UART_4 | UART_5 | UART_6
// SPI : SPI_1 | SPI_2 | SPI_3 | SPI_4
// I2C : I2C_1 | I2C_2 | I2C_3 | I2C_4 | I2C_5
// --------------------- //
// ############################################## //

#ifndef _PIC32_INTERRUPTS_H
#define _PIC32_INTERRUPTS_H 1

// ################## Includes ################## //
#include <hardware.h>

// Lib
#include <peripheral/pic32_cpu.h>

// Definition
#include <definition/stddef_megaxone.h>
#include <definition/datatype_megaxone.h>

//Microchip Lib
#include <cp0defs.h>
#include <peripheral/int.h>
// ############################################## //


// ################### Define ################### //
// -- Vector Number -- //
#if CPU_FAMILY == PIC32MX1xx || CPU_FAMILY == PIC32MX2xx
	#define INT_VEC_CORE_TIMER			0
	#define INT_VEC_CORE_SOFT_0			1
	#define INT_VEC_CORE_SOFT_1			2
	#define INT_VEC_EXT_INT_0			3
	#define INT_VEC_TIMER_1				4
	#define INT_VEC_INPUT_CAPTURE_1_ERR		5
	#define INT_VEC_INPUT_CAPTURE_1			5
	#define INT_VEC_OUTPUT_COMPARE_1		6
	#define INT_VEC_EXT_INT_1			7
	#define INT_VEC_TIMER_2				8
	#define INT_VEC_INPUT_CAPTURE_2_ERR		9
	#define INT_VEC_INPUT_CAPTURE_2			9
	#define INT_VEC_OUTPUT_COMPARE_2		10
	#define INT_VEC_EXT_INT_2			11
	#define INT_VEC_TIMER_3				12
	#define INT_VEC_INPUT_CAPTURE_3_ERR		13
	#define INT_VEC_INPUT_CAPTURE_3			13
	#define INT_VEC_OUTPUT_COMPARE_3		14
	#define INT_VEC_EXT_INT_3			15
	#define INT_VEC_TIMER_4				16
	#define INT_VEC_INPUT_CAPTURE_4_ERR		17
	#define INT_VEC_INPUT_CAPTURE_4			17
	#define INT_VEC_OUTPUT_COMPARE_4		18
	#define INT_VEC_EXT_INT_4			19
	#define INT_VEC_TIMER_5				20
	#define INT_VEC_INPUT_CAPTURE_5_ERR		21
	#define INT_VEC_INPUT_CAPTURE_5			21
	#define INT_VEC_OUTPUT_COMPARE_5		22
	#define INT_VEC_ADC_1				23
	#define INT_VEC_FAIL_SAFE_CLOCK_MON		24
	#define INT_VEC_RTCC				25
	#define INT_VEC_FLASH_CONTROL_EVENT		26
	#define INT_VEC_COMPARATOR_1			27
	#define INT_VEC_COMPARATOR_2			28
	#define INT_VEC_COMPARATOR_3			29
	#define INT_VEC_USB				30
	#define INT_VEC_SPI_1				31
	#define INT_VEC_SPI_1_ERR			31
	#define INT_VEC_SPI_1_RX			31
	#define INT_VEC_SPI_1_TX			31
	#define INT_VEC_UART_1				32
	#define INT_VEC_UART_1_ERR			32
	#define INT_VEC_UART_1_RX			32
	#define INT_VEC_UART_1_TX			32
	#define INT_VEC_I2C_1				33
	#define INT_VEC_I2C_1_COL			33
	#define INT_VEC_I2C_1_SLAVE			33
	#define INT_VEC_I2C_1_MASTER			33
	#define INT_VEC_INPUT_CHANGE			34
	#define INT_VEC_INPUT_CHANGE_PORT_A		34
	#define INT_VEC_INPUT_CHANGE_PORT_B		34
	#define INT_VEC_INPUT_CHANGE_PORT_C		34
	#define INT_VEC_PMP				35
	#define INT_VEC_PMP_ERR				35
	#define INT_VEC_SPI_2				36
	#define INT_VEC_SPI_2_ERR			36
	#define INT_VEC_SPI_2_RX			36
	#define INT_VEC_SPI_2_TX			36
	#define INT_VEC_UART_2				37
	#define INT_VEC_UART_2_ERR			37
	#define INT_VEC_UART_2_RX			37
	#define INT_VEC_UART_2_TX			37
	#define INT_VEC_I2C_2				38
	#define INT_VEC_I2C_2_COL			38
	#define INT_VEC_I2C_2_SLAVE			38
	#define INT_VEC_I2C_2_MASTER			38
	#define INT_VEC_CTMU				39
	#define INT_VEC_DMA_0				40
	#define INT_VEC_DMA_1				41
	#define INT_VEC_DMA_2				42
	#define INT_VEC_DMA_3				43
#elif CPU_FAMILY == PIC32MX3xx || CPU_FAMILY == PIC32MX4xx
	#define INT_VEC_CORE_TIMER			0
	#define INT_VEC_CORE_SOFT_0			1
	#define INT_VEC_CORE_SOFT_1			2
	#define INT_VEC_EXT_INT_0			3
	#define INT_VEC_TIMER_1				4
	#define INT_VEC_INPUT_CAPTURE_1			5
	#define INT_VEC_OUTPUT_COMPARE_1		6
	#define INT_VEC_EXT_INT_1			7
	#define INT_VEC_TIMER_2				8
	#define INT_VEC_INPUT_CAPTURE_2			9
	#define INT_VEC_OUTPUT_COMPARE_2		10
	#define INT_VEC_EXT_INT_2			11
	#define INT_VEC_TIMER_3				12
	#define INT_VEC_INPUT_CAPTURE_3			13
	#define INT_VEC_OUTPUT_COMPARE_3		14
	#define INT_VEC_EXT_INT_3			15
	#define INT_VEC_TIMER_4				16
	#define INT_VEC_INPUT_CAPTURE_4			17
	#define INT_VEC_OUTPUT_COMPARE_4		18
	#define INT_VEC_EXT_INT_4			19
	#define INT_VEC_TIMER_5				20
	#define INT_VEC_INPUT_CAPTURE_5			21
	#define INT_VEC_OUTPUT_COMPARE_5		22
	#define INT_VEC_SPI_1				23
	#define INT_VEC_SPI_1_ERR			23
	#define INT_VEC_SPI_1_RX			23
	#define INT_VEC_SPI_1_TX			23
	#define INT_VEC_UART_1				24
	#define INT_VEC_UART_1_ERR			24
	#define INT_VEC_UART_1_RX			24
	#define INT_VEC_UART_1_TX			24
	#define INT_VEC_I2C_1				25
	#define INT_VEC_I2C_1_COL			25
	#define INT_VEC_I2C_1_SLAVE			25
	#define INT_VEC_I2C_1_MASTER			25
	#define INT_VEC_INPUT_CHANGE			26
	#define INT_VEC_ADC_1				27
	#define INT_VEC_PMP				28
	#define INT_VEC_COMPARATOR_1			29
	#define INT_VEC_COMPARATOR_2			30
	#define INT_VEC_SPI_2				31
	#define INT_VEC_SPI_2_ERR			31
	#define INT_VEC_SPI_2_RX			31
	#define INT_VEC_SPI_2_TX			31
	#define INT_VEC_UART_2				32
	#define INT_VEC_UART_2_ERR			32
	#define INT_VEC_UART_2_RX			32
	#define INT_VEC_UART_2_TX			32
	#define INT_VEC_I2C_2				33
	#define INT_VEC_I2C_2_COL			33
	#define INT_VEC_I2C_2_SLAVE			33
	#define INT_VEC_I2C_2_MASTER			33
	#define INT_VEC_FAIL_SAFE_CLOCK_MON		34
	#define INT_VEC_RTCC				35
	#define INT_VEC_DMA_0				36
	#define INT_VEC_DMA_1				37
	#define INT_VEC_DMA_2				38
	#define INT_VEC_DMA_3				39
	#define INT_VEC_FLASH_CONTROL_EVENT		44
	#define INT_VEC_USB				45
#elif CPU_FAMILY == PIC32MX5xxH || CPU_FAMILY == PIC32MX5xxL || CPU_FAMILY == PIC32MX6xx || CPU_FAMILY == PIC32MX7xx
	#define INT_VEC_CORE_TIMER			0
	#define INT_VEC_CORE_SOFT_0			1
	#define INT_VEC_CORE_SOFT_1			2
	#define INT_VEC_EXT_INT_0			3
	#define INT_VEC_TIMER_1				4
	#define INT_VEC_INPUT_CAPTURE_1_ERR		5
	#define INT_VEC_INPUT_CAPTURE_1			5
	#define INT_VEC_OUTPUT_COMPARE_1		6
	#define INT_VEC_EXT_INT_1			7
	#define INT_VEC_TIMER_2				8
	#define INT_VEC_INPUT_CAPTURE_2_ERR		9
	#define INT_VEC_INPUT_CAPTURE_2			9
	#define INT_VEC_OUTPUT_COMPARE_2		10
	#define INT_VEC_EXT_INT_2			11
	#define INT_VEC_TIMER_3				12
	#define INT_VEC_INPUT_CAPTURE_3_ERR		13
	#define INT_VEC_INPUT_CAPTURE_3			13
	#define INT_VEC_OUTPUT_COMPARE_3		14
	#define INT_VEC_EXT_INT_3			15
	#define INT_VEC_TIMER_4				16
	#define INT_VEC_INPUT_CAPTURE_4_ERR		17
	#define INT_VEC_INPUT_CAPTURE_4			17
	#define INT_VEC_OUTPUT_COMPARE_4		18
	#define INT_VEC_EXT_INT_4			19
	#define INT_VEC_TIMER_5				20
	#define INT_VEC_INPUT_CAPTURE_5_ERR		21
	#define INT_VEC_INPUT_CAPTURE_5			21
	#define INT_VEC_OUTPUT_COMPARE_5		22
	#define INT_VEC_SPI_1				23
	#define INT_VEC_SPI_1_ERR			23
	#define INT_VEC_SPI_1_RX			23
	#define INT_VEC_SPI_1_TX			23
	#define INT_VEC_UART_1				24
	#define INT_VEC_UART_1_ERR			24
	#define INT_VEC_UART_1_RX			24
	#define INT_VEC_UART_1_TX			24
	#define INT_VEC_SPI_3				24
	#define INT_VEC_SPI_3_ERR			24
	#define INT_VEC_SPI_3_RX			24
	#define INT_VEC_SPI_3_TX			24
	#define INT_VEC_I2C_3				24
	#define INT_VEC_I2C_3_COL			24
	#define INT_VEC_I2C_3_SLAVE			24
	#define INT_VEC_I2C_3_MASTER			24
	#define INT_VEC_I2C_1				25
	#define INT_VEC_I2C_1_COL			25
	#define INT_VEC_I2C_1_SLAVE			25
	#define INT_VEC_I2C_1_MASTER			25
	#define INT_VEC_INPUT_CHANGE			26
	#define INT_VEC_ADC_1				27
	#define INT_VEC_PMP				28
	#define INT_VEC_PMP_ERR				28
	#define INT_VEC_COMPARATOR_1			29
	#define INT_VEC_COMPARATOR_2			30
	#define INT_VEC_UART_3				31
	#define INT_VEC_UART_3_ERR			31
	#define INT_VEC_UART_3_RX			31
	#define INT_VEC_UART_3_TX			31
	#define INT_VEC_SPI_2				31
	#define INT_VEC_SPI_2_ERR			31
	#define INT_VEC_SPI_2_RX			31
	#define INT_VEC_SPI_2_TX			31
	#define INT_VEC_I2C_4				31
	#define INT_VEC_I2C_4_COL			31
	#define INT_VEC_I2C_4_SLAVE			31
	#define INT_VEC_I2C_4_MASTER			31
	#define INT_VEC_UART_2				32
	#define INT_VEC_UART_2_ERR			32
	#define INT_VEC_UART_2_RX			32
	#define INT_VEC_UART_2_TX			32
	#define INT_VEC_SPI_4				32
	#define INT_VEC_SPI_4_ERR			32
	#define INT_VEC_SPI_4_RX			32
	#define INT_VEC_SPI_4_TX			32
	#define INT_VEC_I2C_5				32
	#define INT_VEC_I2C_5_COL			32
	#define INT_VEC_I2C_5_SLAVE			32
	#define INT_VEC_I2C_5_MASTER			32
	#define INT_VEC_I2C_2				33
	#define INT_VEC_I2C_2_COL			33
	#define INT_VEC_I2C_2_SLAVE			33
	#define INT_VEC_I2C_2_MASTER			33
	#define INT_VEC_FAIL_SAFE_CLOCK_MON		34
	#define INT_VEC_RTCC				35
	#define INT_VEC_DMA_0				36
	#define INT_VEC_DMA_1				37
	#define INT_VEC_DMA_2				38
	#define INT_VEC_DMA_3				39
	#define INT_VEC_DMA_4				40
	#define INT_VEC_DMA_5				41
	#define INT_VEC_DMA_6				42
	#define INT_VEC_DMA_7				43
	#define INT_VEC_FLASH_CONTROL_EVENT		44
	#define INT_VEC_USB				45
	#define INT_VEC_CAN_1				46
	#define INT_VEC_CAN_2				47
	#define INT_VEC_ETHERNET			48
	#define INT_VEC_UART_4				49
	#define INT_VEC_UART_4_ERR			49
	#define INT_VEC_UART_4_RX			49
	#define INT_VEC_UART_4_TX			49
	#define INT_VEC_UART_6				50
	#define INT_VEC_UART_6_ERR			50
	#define INT_VEC_UART_6_RX			50
	#define INT_VEC_UART_6_TX			50
	#define INT_VEC_UART_5				51
	#define INT_VEC_UART_5_ERR			51
	#define INT_VEC_UART_5_RX			51
	#define INT_VEC_UART_5_TX			51
#endif
// ------------------- //
// ############################################## //


// ################# Data Type ################## //
// CP0 Error Type
typedef enum
{
	CP0E_interrupt = 0,
	CP0E_addressLoadFetch = 4,
	CP0E_addressStore = 5,
	CP0E_busFetch = 6,
	CP0E_busLoadStore = 7,
	CP0E_syscall = 8,
	CP0E_breakPoint = 9,
	CP0E_reserveInstruction = 10,
	CP0E_coProcessorUnusable = 11,
	CP0E_arithmeticOverflow = 12,
	CP0E_trap = 13
}tCP0Error;

// -- IRQ Number -- //
#if CPU_FAMILY == PIC32MX1xx || CPU_FAMILY == PIC32MX2xx
typedef enum
{
	IRQ_CORE_TIMER = 0,
	IRQ_CORE_SOFT_0 = 1,
	IRQ_CORE_SOFT_1 = 2,
	IRQ_EXT_INT_0 = 3,
	IRQ_TIMER_1 = 4,
	IRQ_INPUT_CAPTURE_1_ERR = 5,
	IRQ_INPUT_CAPTURE_1 = 6,
	IRQ_OUTPUT_COMPARE_1 = 7,
	IRQ_EXT_INT_1 = 8,
	IRQ_TIMER_2 = 9,
	IRQ_TIMER_23 = 0x89,
	IRQ_INPUT_CAPTURE_2_ERR = 10,
	IRQ_INPUT_CAPTURE_2 = 11,
	IRQ_OUTPUT_COMPARE_2 = 12,
	IRQ_EXT_INT_2 = 13,
	IRQ_TIMER_3 = 14,
	IRQ_INPUT_CAPTURE_3_ERR = 15,
	IRQ_INPUT_CAPTURE_3 = 16,
	IRQ_OUTPUT_COMPARE_3 = 17,
	IRQ_EXT_INT_3 = 18,
	IRQ_TIMER_4 = 19,
	IRQ_TIMER_45 = 0x93,
	IRQ_INPUT_CAPTURE_4_ERR = 20,
	IRQ_INPUT_CAPTURE_4 = 21,
	IRQ_OUTPUT_COMPARE_4 = 22,
	IRQ_EXT_INT_4 = 23,
	IRQ_TIMER_5 = 24,
	IRQ_INPUT_CAPTURE_5_ERR = 25,
	IRQ_INPUT_CAPTURE_5 = 26,
	IRQ_OUTPUT_COMPARE_5 = 27,
	IRQ_ADC_1 = 28,
	IRQ_FAIL_SAFE_CLOCK_MON = 29,
	IRQ_RTCC = 30,
	IRQ_FLASH_CONTROL_EVENT = 31,
	IRQ_COMPARATOR_1 = 32,
	IRQ_COMPARATOR_2 = 33,
	IRQ_COMPARATOR_3 = 34,
	IRQ_USB = 35,
	IRQ_SPI_1_ERR = 36,
	IRQ_SPI_1_RX = 37,
	IRQ_SPI_1_TX = 38,
	IRQ_SPI_1 = 0xA4,
	IRQ_UART_1_ERR = 39,
	IRQ_UART_1_RX = 40,
	IRQ_UART_1_TX = 41,
	IRQ_UART_1 = 0xA7,
	IRQ_I2C_1_COL = 42,
	IRQ_I2C_1_SLAVE = 43,
	IRQ_I2C_1_MASTER = 44,
	IRQ_I2C_1 = 0xAA,
	IRQ_INPUT_CHANGE_PORT_A = 45,
	IRQ_INPUT_CHANGE_PORT_B = 46,
	IRQ_INPUT_CHANGE_PORT_C = 47,
	IRQ_INPUT_CHANGE = 0xAD,
	IRQ_PMP = 48,
	IRQ_PMP_ERR = 49,
	IRQ_SPI_2_ERR = 50,
	IRQ_SPI_2_RX = 51,
	IRQ_SPI_2_TX = 52,
	IRQ_SPI_2 = 0xB2,
	IRQ_UART_2_ERR = 53,
	IRQ_UART_2_RX = 54,
	IRQ_UART_2_TX = 55,
	IRQ_UART_2 = 0xB5,
	IRQ_I2C_2_COL = 56,
	IRQ_I2C_2_SLAVE = 57,
	IRQ_I2C_2_MASTER = 58,
	IRQ_I2C_2 = 50xB8,
	IRQ_CTMU = 59,
	IRQ_DMA_0 = 60,
	IRQ_DMA_1 = 61,
	IRQ_DMA_2 = 62,
	IRQ_DMA_3 = 63
}tIntIRQ;
#elif CPU_FAMILY == PIC32MX3xx || CPU_FAMILY == PIC32MX4xx
typedef enum
{
	IRQ_CORE_TIMER = 0,
	IRQ_CORE_SOFT_0 = 1,
	IRQ_CORE_SOFT_1 = 2,
	IRQ_EXT_INT_0 = 3,
	IRQ_TIMER_1 = 4,
	IRQ_INPUT_CAPTURE_1 = 5,
	IRQ_OUTPUT_COMPARE_1 = 6,
	IRQ_EXT_INT_1 = 7,
	IRQ_TIMER_2 = 8,
	IRQ_TIMER_23 = 0x88,
	IRQ_INPUT_CAPTURE_2 = 9,
	IRQ_OUTPUT_COMPARE_2 = 10,
	IRQ_EXT_INT_2 = 11,
	IRQ_TIMER_3 = 12,
	IRQ_INPUT_CAPTURE_3 = 13,
	IRQ_OUTPUT_COMPARE_3 = 14,
	IRQ_EXT_INT_3 = 15,
	IRQ_TIMER_4 = 16,
	IRQ_TIMER_45 = 0x90,
	IRQ_INPUT_CAPTURE_4 = 17,
	IRQ_OUTPUT_COMPARE_4 = 18,
	IRQ_EXT_INT_4 = 19,
	IRQ_TIMER_5 = 20,
	IRQ_INPUT_CAPTURE_5 = 21,
	IRQ_OUTPUT_COMPARE_5 = 22,
	IRQ_SPI_1_ERR = 23,
	IRQ_SPI_1_RX = 24,
	IRQ_SPI_1_TX = 25,
	IRQ_SPI_1 = 0x97,
	IRQ_UART_1_ERR = 26,
	IRQ_UART_1_RX = 27,
	IRQ_UART_1_TX = 28,
	IRQ_UART_1 = 0x9A,
	IRQ_I2C_1_COL = 29,
	IRQ_I2C_1_SLAVE = 30,
	IRQ_I2C_1_MASTER = 31,
	IRQ_I2C_1 = 0x9D,
	IRQ_INPUT_CHANGE = 32,
	IRQ_ADC_1 = 33,
	IRQ_PMP = 34,
	IRQ_COMPARATOR_1 = 35,
	IRQ_COMPARATOR_2 = 36,
	IRQ_SPI_2_ERR = 37,
	IRQ_SPI_2_RX = 38,
	IRQ_SPI_2_TX = 39,
	IRQ_SPI_2 = 0xA5,
	IRQ_UART_2_ERR = 40,
	IRQ_UART_2_RX = 41,
	IRQ_UART_2_TX = 42,
	IRQ_UART_2 = 0xA8,
	IRQ_I2C_2_COL = 43,
	IRQ_I2C_2_SLAVE = 44,
	IRQ_I2C_2_MASTER = 45,
	IRQ_I2C_2 = 0xAB,
	IRQ_FAIL_SAFE_CLOCK_MON = 46,
	IRQ_RTCC = 47,
	IRQ_DMA_0 = 48,
	IRQ_DMA_1 = 49,
	IRQ_DMA_2 = 50,
	IRQ_DMA_3 = 51,
	IRQ_FLASH_CONTROL_EVENT = 56,
	IRQ_USB = 57
}tIntIRQ;
#elif CPU_FAMILY == PIC32MX5xxH || CPU_FAMILY == PIC32MX5xxL || CPU_FAMILY == PIC32MX6xx || CPU_FAMILY == PIC32MX7xx
typedef enum
{
	IRQ_CORE_TIMER = 0,
	IRQ_CORE_SOFT_0 = 1,
	IRQ_CORE_SOFT_1 = 2,
	IRQ_EXT_INT_0 = 3,
	IRQ_TIMER_1 = 4,
	IRQ_INPUT_CAPTURE_1 = 5,
	IRQ_OUTPUT_COMPARE_1 = 6,
	IRQ_EXT_INT_1 = 7,
	IRQ_TIMER_2 = 8,
	IRQ_TIMER_23 = 0x88,
	IRQ_INPUT_CAPTURE_2 = 9,
	IRQ_OUTPUT_COMPARE_2 = 10,
	IRQ_EXT_INT_2 = 11,
	IRQ_TIMER_3 = 12,
	IRQ_INPUT_CAPTURE_3 = 13,
	IRQ_OUTPUT_COMPARE_3 = 14,
	IRQ_EXT_INT_3 = 15,
	IRQ_TIMER_4 = 16,
	IRQ_TIMER_45 = 0x90,
	IRQ_INPUT_CAPTURE_4 = 17,
	IRQ_OUTPUT_COMPARE_4 = 18,
	IRQ_EXT_INT_4 = 19,
	IRQ_TIMER_5 = 20,
	IRQ_INPUT_CAPTURE_5 = 21,
	IRQ_OUTPUT_COMPARE_5 = 22,
	IRQ_SPI_1_ERR = 23,
	IRQ_SPI_1_RX = 24,
	IRQ_SPI_1_TX = 25,
	IRQ_SPI_1 = 0x97,
	IRQ_UART_1_ERR = 26,
	IRQ_UART_1_RX = 27,
	IRQ_UART_1_TX = 28,
	IRQ_UART_1 = 0x9A,
	IRQ_SPI_3_ERR = 26,
	IRQ_SPI_3_RX = 27,
	IRQ_SPI_3_TX = 28,
	IRQ_SPI_3 = 0x9A,
	IRQ_I2C_3_COL = 26,
	IRQ_I2C_3_SLAVE = 27,
	IRQ_I2C_3_MASTER = 28,
	IRQ_I2C_3 = 0x9A,
	IRQ_I2C_1_COL = 29,
	IRQ_I2C_1_SLAVE = 30,
	IRQ_I2C_1_MASTER = 31,
	IRQ_I2C_1 = 0x9D,
	IRQ_INPUT_CHANGE = 32,
	IRQ_ADC_1 = 33,
	IRQ_PMP = 34,
	IRQ_COMPARATOR_1 = 35,
	IRQ_COMPARATOR_2 = 36,
	IRQ_UART_3_ERR = 37,
	IRQ_UART_3_RX = 38,
	IRQ_UART_3_TX = 39,
	IRQ_UART_3 = 0xA5,
	IRQ_SPI_2_ERR = 37,
	IRQ_SPI_2_RX = 38,
	IRQ_SPI_2_TX = 39,
	IRQ_SPI_2 = 0xA5,
	IRQ_I2C_4_COL = 37,
	IRQ_I2C_4_SLAVE = 38,
	IRQ_I2C_4_MASTER = 39,
	IRQ_I2C_4 = 0xA5,
	IRQ_UART_2_ERR = 40,
	IRQ_UART_2_RX = 41,
	IRQ_UART_2_TX = 42,
	IRQ_UART_2 = 0xA8,
	IRQ_SPI_4_ERR = 40,
	IRQ_SPI_4_RX = 41,
	IRQ_SPI_4_TX = 42,
	IRQ_SPI_4 = 0xA8,
	IRQ_I2C_5_COL = 40,
	IRQ_I2C_5_SLAVE = 41,
	IRQ_I2C_5_MASTER = 42,
	IRQ_I2C_5 = 0xA8,
	IRQ_I2C_2_COL = 43,
	IRQ_I2C_2_SLAVE = 44,
	IRQ_I2C_2_MASTER = 45,
	IRQ_I2C_2 = 0xAB,
	IRQ_FAIL_SAFE_CLOCK_MON = 46,
	IRQ_RTCC = 47,
	IRQ_DMA_0 = 48,
	IRQ_DMA_1 = 49,
	IRQ_DMA_2 = 50,
	IRQ_DMA_3 = 51,
	IRQ_DMA_4 = 52,
	IRQ_DMA_5 = 53,
	IRQ_DMA_6 = 54,
	IRQ_DMA_7 = 55,
	IRQ_FLASH_CONTROL_EVENT = 56,
	IRQ_USB = 57,
	IRQ_CAN_1 = 58,
	IRQ_CAN_2 = 59,
	IRQ_ETHERNET = 60,
	IRQ_INPUT_CAPTURE_1_ERR = 61,
	IRQ_INPUT_CAPTURE_2_ERR = 62,
	IRQ_INPUT_CAPTURE_3_ERR = 63,
	IRQ_INPUT_CAPTURE_4_ERR = 64,
	IRQ_INPUT_CAPTURE_5_ERR = 65,
	IRQ_PMP_ERR = 66,
	IRQ_UART_4_ERR = 67,
	IRQ_UART_4_RX = 68,
	IRQ_UART_4_TX = 69,
	IRQ_UART_4 = 0xC3,
	IRQ_UART_6_ERR = 70,
	IRQ_UART_6_RX = 71,
	IRQ_UART_6_TX = 72,
	IRQ_UART_6 = 0xC6,
	IRQ_UART_5_ERR = 73,
	IRQ_UART_5_RX = 74,
	IRQ_UART_5_TX = 75,
	IRQ_UART_5 = 0xC9
}tIntIRQ;
#endif
// ---------------- //
// ############################################## //


// ################# Fast Macro ################# //
/**
* \fn		intFastEnableGlobal()
* @brief	Macro to enable the global interrupt Enable
* @note		This function also return the state of the Status CP0 Register
* @arg		nothing
* @return	U32 intGlobalState		State of the CP0 Status register before enabling
*/
#define	intFastEnableGlobal()				INTEnableInterrupts()

/**
* \fn		intFastDisableGlobal()
* @brief	Macro to disable the global interrupt Enable
* @note		This function also return the state of the Status CP0 Register
* @arg		nothing
* @return	U32 intGlobalState		State of the CP0 Status register before disabling
*/
#define	intFastDisableGlobal()				INTDisableInterrupts()

/**
* \fn		intFastRestoreGlobal(intGlobalState)
* @brief	Macro to restore the global interrupt Enable to a specified state
* @note
* @arg		U32 intGlobalState		State of CP0 Status register to restore
* @return	nothing
*/
#define	intFastRestoreGlobal(intGlobalState)		INTRestoreInterrupts(intGlobalState)

/**
* \fn		intFastGetGlobal()
* @brief	Macro to return the actual state of global interrupt Enable
* @note		This macro check only the IE bit in the CP0 Status Register
* @arg		nothing
* @return	U8 intGlobalState		The state of the global interrupt Enable (1: Enabled | 0: Disabled)
*/
#define	intFastGetGlobal()				((_CP0_GET_STATUS()) & 0x1)

/**
* \fn		intFastSetGlobal(intGlobalState)
* @brief	Macro to set the state of global interrupt Enable
* @note
* @arg		U8 intGlobalState		The state to set the global interrupt Enable (1: Enabled | 0: Disabled)
* @return	nothing
*/
#define	intFastSetGlobal(intGlobalState)		(_CP0_SET_STATUS(((_CP0_GET_STATUS())|(intGlobalState & 0x1))))

/**
* \fn		intFastInit(intSource)
* @brief	Macro to initialize a designated interrupt source
* @note		Use Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to initialize
* @return	nothing
*/
#define intFastInit(intSource)				(intFastClearFlag(intSource));	(intFastEnable(intSource))

/**
* \fn		intFastEnable(intSource)
* @brief	Macro to enable a designated interrupt source
* @note		Use Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to enable
* @return	nothing
*/
#define intFastEnable(intSource)			((CONCAT3(IEC,CONCAT(_REG_,intSource),SET)) = (CONCAT(_MASK_,intSource)))

/**
* \fn		intFastDisable(intSource)
* @brief	Macro to disable a designated interrupt source
* @note		Use Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to disable
* @return	nothing
*/
#define intFastDisable(intSource)			((CONCAT3(IEC,CONCAT(_REG_,intSource),CLR)) = (CONCAT(_MASK_,intSource)))

/**
* \fn		intFastGetState(intSource)
* @brief	Macro to return the actual enable state of a designated interrupt source
* @note		Use Interrupt source list for intSource
*		The return value is aligned to bit0 not to the corresponding mask
* @arg		intSource			The name of the interrupt source to return
* @return	U32 intState			interrupt source enable state (1: Enabled | 0: Disabled )
*/
#define intFastGetState(intSource)			(((CONCAT(IEC,CONCAT(_REG_,intSource))) & (CONCAT(_MASK_,intSource))) >> (CONCAT(_POS_,intSource)))

/**
* \fn		intFastSetState(intSource,intState)
* @brief	Macro to set the enable state of a designated interrupt source
* @note		Use Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to set
* @arg		U32 intState			The state to set the interrupt source to (1: Enabled | 0: Disabled)
* @return	nothing
*/
#define intFastSetState(intSource,intState)		((CONCAT(IEC,CONCAT(_REG_,intSource))) |= (CONCAT(_MASK_,intSource)) & ((intState) << (CONCAT(_POS_,intSource))))

/**
* \fn		intFastGetPriority(intSource)
* @brief	Macro to return the actual priority level of a designated interrupt source
* @note		Use Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to return
* @return	U8 intPrio			interrupt priority level (0 to 7)
*/
#define intFastGetPriority(intSource)			(CONCAT(_IPC_,intSource))

/**
* \fn		intFastSetPriority(intSource,intPrio)
* @brief	Macro to set the priority level of a designated interrupt source
* @note		Use the Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to return
* @arg		U8 intPrio			interrupt priority level (0 to 7)
* @return	nothing
*/
#define intFastSetPriority(intSource,intPrio)		((CONCAT(_IPC_,intSource)) = (intPrio))

/**
* \fn		intFastGetSubPriority(intSource)
* @brief	Macro to return the actual sub-priority level of a designated interrupt source
* @note		Use the Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to return
* @return	U8 intSubPrio			interrupt sub-priority level (0 to 3)
*/
#define intFastGetSubPriority(intSource)		(CONCAT(_SIPC_,intSource))

/**
* \fn		intFastSetSubPriority(intSource,intSubPrio)
* @brief	Macro to set the sub-priority level of a designated interrupt source
* @note		Use the Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to return
* @arg		U8 intSubPrio			interrupt priority level (0 to 3)
* @return	nothing
*/
#define intFastSetSubPriority(intSource,intSubPrio)	((CONCAT(_SIPC_,intSource)) = (intSubPrio))

/**
* \fn		intFastCheckFlag(intSource)
* @brief	Macro to check the flag and the enable of a designated interrupt source
* @note		Use the Interrupt source list for intSource
*		This macro is 1 instruction shorter than doing intFastGetState() & intFastGetFlag()
*		The return value is aligned to bit0 not to the corresponding mask
* @arg		intSource			The name of the interrupt source to check
* @return	U32 intFlagState		The state of the interrupt (1: Interrupt generated | 0: No interrupt generated)
*/
#define intFastCheckFlag(intSource)			((((CONCAT(IEC,CONCAT(_REG_,intSource))) & (CONCAT(IFS,CONCAT(_REG_,intSource)))) & (CONCAT(_MASK_,intSource))) >> (CONCAT(_POS_,intSource)))

