laurencedv/PIClib/lib/peripheral/pic32_interrupt.h
/**
* \fn		intFastGetFlag(intSource)
* @brief	Macro to return the flag of a designated interrupt source
* @note		Use the Interrupt source list for intSource
*		The return value is aligned to bit0 not to the corresponding mask
* @arg		intSource			The name of the interrupt source to return
* @return	U32 intFlagState		The state of the flag (1: Interrupt condition | 0: No interrupt condition)
*/
#define intFastGetFlag(intSource)			(((CONCAT(IFS,CONCAT(_REG_,intSource))) & (CONCAT(_MASK_,intSource))) >> (CONCAT(_POS_,intSource)))

/**
* \fn		intFastSetFlag(intSource)
* @brief	Macro to set the flag of a designated interrupt source
* @note		Use the Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to set
* @return	nothing
*/
#define intFastSetFlag(intSource)			((CONCAT3(IFS,CONCAT(_REG_,intSource),SET)) = (CONCAT(_MASK_,intSource)))

/**
* \fn		intFastClearFlag(intSource)
* @brief	Macro to clear the flag of a designated interrupt source
* @note		Use the Interrupt source list for intSource
* @arg		intSource			The name of the interrupt source to clear
* @return	nothing
*/
#define intFastClearFlag(intSource)			((CONCAT3(IFS,CONCAT(_REG_,intSource),CLR)) = (CONCAT(_MASK_,intSource)))

// ############################################## //




// ############# Interrupts Functions ########### //
/**
* \fn		void intInit(intIRQSource)
* @brief	Initialize an interrupt
* @note		Will clear the flag prior to enabling the interrupt
*		Can accept IRQ group
* @arg		tIntIRQ intIRQSource		Which interrupt to init
* @return	nothing
*/
#define intInit(intIRQSource)				_intSetReg((U32*)&IFS0,intIRQSource,DISABLE); _intSetReg((U32*)&IEC0,intIRQSource,ENABLE)

/**
* \fn		void intSetState(intIRQSource, state)
* @brief	Set the state of a specific interrupt
* @note		Use tIntIRQ to know which interrupt is available
*		Use ENABLE or DISABLE for $state but if you are using
*		an IRQ group,use the correct number of bit (ex: IRQ_UART_1 , BIT2|BIT1|BIT0)
* @arg		tIntIRQ intIRQSource		Which interrupt to set
* @arg		U8 state			State to set the interrupt
* @return	nothing
*/
#define intSetState(intIRQSource, state)		_intSetReg((U32*)&IEC0,intIRQSource,state)

/**
* \fn		void intGetState(intIRQSource, state)
* @brief	Get the state of a specific interrupt
* @note		Use tIntIRQ to know which interrupt is available
*		The state is return as ENABLE or DISABLE but if you are using
*		an IRQ group, it will return all the bits (ex: IRQ_UART_1 returns 0x7)
* @arg		tIntIRQ intIRQSource		Which interrupt to set
* @return	U8 state			State of the interrupt
*/
#define intGetState(intIRQSource)			_intGetReg((U32*)&IEC0,intIRQSource)

/**
* \fn		void intSetFlag(intIRQSource, state)
* @brief	Set the state of the flag of a specific interrupt
* @note		Use tIntIRQ to know which interrupt is available
*		Use ENABLE or DISABLE for $state but if you are using
*		an IRQ group,use the correct number of bit (ex: IRQ_UART_1 , BIT2|BIT1|BIT0)
* @arg		tIntIRQ intIRQSource		Which interrupt to set
* @arg		U8 state			State to set the flag
* @return	nothing
*/
#define intSetFlag(intIRQSource, state)			_intSetReg(&IFS0,intIRQSource,state)

/**
* \fn		void intGetFlag(intIRQSource, state)
* @brief	Get the state of the flag of a specific interrupt
* @note		Use tIntIRQ to know which interrupt is available
*		The state is return as ENABLE or DISABLE but if you are using
*		an IRQ group, it will return all the bits (ex: IRQ_UART_1 returns 0x7)
* @arg		tIntIRQ intIRQSource		Which interrupt to set
* @return	U8 state			State of the flag
*/
#define intGetFlag(intIRQSource)			_intGetReg(&IFS0,intIRQSource)

/**
* \fn		void intSetPriority(tIntIRQ intIRQSource, U8 priorityLvl, U8 subPriorityLvl)
* @brief	Set the priority and the sub-priority of an interrupt
* @note		If you use IRQ Group you will only set the priority for the first IRQ (ex: UART_1 would be UART_1_ERR)
* @arg		tIntIRQ intIRQSource		Which interrupt to set
* @arg		U8 priorityLvl			Level of priority for the interrupt
* @arg		U8 subPriorityLvl		Level of sub-priority for the interrupt
* @return	nothing
*/
void intSetPriority(tIntIRQ intIRQSource, U8 priorityLvl, U8 subPriorityLvl);

/**
* \fn		U8 intGetPriority(tIntIRQ intIRQSource)
* @brief	Return the priority level of an interrupt
* @note		If you use IRQ Group you will only get the priority of the first IRQ (ex: UART_1 would give UART_1_ERR)
* @arg		tIntIRQ intIRQSource		Which interrupt to get
* @return	U8 priorityLvl			Level of priority of the interrupt
*/
U8 intGetPriority(tIntIRQ intIRQSource);

/**
* \fn		U8 intGetSubPriority(tIntIRQ intIRQSource)
* @brief	Return the sub-priority level of an interrupt
* @note		If you use IRQ Group you will only get the subPriority of the first IRQ (ex: UART_1 would give UART_1_ERR)
* @arg		tIntIRQ intIRQSource		Which interrupt to get
* @return	U8 subPriorityLvl		Level of sub-priority of the interrupt
*/
U8 intGetSubPriority(tIntIRQ intIRQSource);

/**
* \fn		void intSetExternalEdge(U8 intSource, U8 edgeDirection)
* @brief	Set the specified external interrupt source to trigger on a specific edge transition
* @note		Use the tIntIRQ type to select the correct interrupt source (only IRQ_EXT_INT are valid)
* @arg		tIntIRQ intIRQSource		The external interrupt to configure
* @arg		U8 edgeDirection		The edge transition to select
* @return	nothing
*/
void intSetExternalEdge(tIntIRQ intIRQSource, U8 edgeDirection);
// ############################################## //


// ############## Exception handler ############# //
/**
* \fn		void _general_exception_handler (U32 cause, U32 status)
* @brief	Exception handler for the M4K core
* @note		The processor branch here when an exception other than interrupt or bootstrap code
*		is generated
* @return	nothing
*/
void _general_exception_handler(void);
// ############################################## //


// ############# Internal Definition ############ //
// -- Interrupts Priority -- //
#if CPU_FAMILY == PIC32MX1xx || CPU_FAMILY == PIC32MX2xx
//Priority
	#define	_IPC_INT_CORE_TIMER				(IPC0bits.CTIP)
	#define	_IPC_INT_CORE_SOFT_0				(IPC0bits.CS0IP)
	#define	_IPC_INT_CORE_SOFT_1				(IPC0bits.CS1IP)
	#define	_IPC_INT_EXT_INT_0				(IPC0bits.INT0IP)
	#define	_IPC_INT_TIMER_1				(IPC1bits.T1IP)
	#define	_IPC_INT_INPUT_CAPTURE_1_ERR			(IPC1bits.IC1IP)
	#define	_IPC_INT_INPUT_CAPTURE_1			(IPC1bits.IC1IP)
	#define	_IPC_INT_OUTPUT_COMPARE_1			(IPC1bits.OC1IP)
	#define	_IPC_INT_EXT_INT_1				(IPC1bits.INT1IP)
	#define	_IPC_INT_TIMER_2				(IPC2bits.T2IP)
	#define	_IPC_INT_INPUT_CAPTURE_2_ERR			(IPC2bits.IC2IP)
	#define	_IPC_INT_INPUT_CAPTURE_2			(IPC2bits.IC2IP)
	#define	_IPC_INT_OUTPUT_COMPARE_2			(IPC2bits.OC2IP)
	#define	_IPC_INT_EXT_INT_2				(IPC2bits.INT2IP)
	#define	_IPC_INT_TIMER_3				(IPC3bits.T3IP)
	#define	_IPC_INT_INPUT_CAPTURE_3_ERR			(IPC3bits.IC3IP)
	#define	_IPC_INT_INPUT_CAPTURE_3			(IPC3bits.IC3IP)
	#define	_IPC_INT_OUTPUT_COMPARE_3			(IPC3bits.OC3IP)
	#define	_IPC_INT_EXT_INT_3				(IPC3bits.INT3IP)
	#define	_IPC_INT_TIMER_4				(IPC4bits.T4IP)
	#define	_IPC_INT_INPUT_CAPTURE_4_ERR			(IPC4bits.IC4IP)
	#define	_IPC_INT_INPUT_CAPTURE_4			(IPC4bits.IC4IP)
	#define	_IPC_INT_OUTPUT_COMPARE_4			(IPC4bits.OC4IP)
	#define	_IPC_INT_EXT_INT_4				(IPC4bits.INT4IP)
	#define	_IPC_INT_TIMER_5				(IPC5bits.T5IP)
	#define	_IPC_INT_INPUT_CAPTURE_5_ERR			(IPC5bits.IC5IP)
	#define	_IPC_INT_INPUT_CAPTURE_5			(IPC5bits.IC5IP)
	#define	_IPC_INT_OUTPUT_COMPARE_5			(IPC5bits.OC5IP)
	#define	_IPC_INT_ADC_1					(IPC5bits.AD1IP)
	#define	_IPC_INT_FAIL_SAFE_CLOCK_MON			(IPC6bits.FSCMIP)
	#define	_IPC_INT_RTCC					(IPC6bits.RTCCIP)
	#define	_IPC_INT_FLASH_CONTROL_EVENT			(IPC6bits.FCEIP)
	#define	_IPC_INT_COMPARATOR_1				(IPC6bits.CMP1IP)
	#define	_IPC_INT_COMPARATOR_2				(IPC7bits.CMP2IP)
	#define	_IPC_INT_COMPARATOR_3				(IPC7bits.CMP3IP)
	#define	_IPC_INT_USB					(IPC7bits.USBIP)
	#define	_IPC_INT_SPI_1_ERR				(IPC7bits.SPI1IP)
	#define	_IPC_INT_SPI_1_RX				(IPC7bits.SPI1IP)
	#define	_IPC_INT_SPI_1_TX				(IPC7bits.SPI1IP)
	#define _IPC_INT_UART_1_ERR				(IPC8bits.U1IP)
	#define _IPC_INT_UART_1_RX				(IPC8bits.U1IP)
	#define _IPC_INT_UART_1_TX				(IPC8bits.U1IP)
	#define	_IPC_INT_I2C_1_COL				(IPC8bits.I2C1IP)
	#define	_IPC_INT_I2C_1_SLAVE				(IPC8bits.I2C1IP)
	#define	_IPC_INT_I2C_1_MASTER				(IPC8bits.I2C1IP)
	#define	_IPC_INT_INPUT_CHANGE_PORT_A			(IPC8bits.CNIP)
	#define	_IPC_INT_INPUT_CHANGE_PORT_B			(IPC8bits.CNIP)
	#define	_IPC_INT_INPUT_CHANGE_PORT_C			(IPC8bits.CNIP)
	#define	_IPC_INT_PMP					(IPC8bits.PMPIP)
	#define	_IPC_INT_PMP_ERR				(IPC8bits.PMPIP)
	#define	_IPC_INT_SPI_2_ERR				(IPC9bits.SPI2IP)
	#define	_IPC_INT_SPI_2_RX				(IPC9bits.SPI2IP)
	#define	_IPC_INT_SPI_2_TX				(IPC9bits.SPI2IP)
	#define _IPC_INT_UART_2_ERR				(IPC9bits.U2IP)
	#define _IPC_INT_UART_2_RX				(IPC9bits.U2IP)
	#define _IPC_INT_UART_2_TX				(IPC9bits.U2IP)
	#define	_IPC_INT_I2C_2_COL				(IPC9bits.I2C2IP)
	#define	_IPC_INT_I2C_2_SLAVE				(IPC9bits.I2C2IP)
	#define	_IPC_INT_I2C_2_MASTER				(IPC9bits.I2C2IP)
	#define	_IPC_INT_CTMU					(IPC9bits.CTMUIP)
	#define	_IPC_INT_DMA_0					(IPC10bits.DMA0IP)
	#define	_IPC_INT_DMA_1					(IPC10bits.DMA1IP)
	#define	_IPC_INT_DMA_2					(IPC10bits.DMA2IP)
	#define	_IPC_INT_DMA_3					(IPC10bits.DMA3IP)

//Sub-priority
	#define	_SIPC_INT_CORE_TIMER				(IPC0bits.CTIS)
	#define	_SIPC_INT_CORE_SOFT_0				(IPC0bits.CS0IS)
	#define	_SIPC_INT_CORE_SOFT_1				(IPC0bits.CS1IS)
	#define	_SIPC_INT_EXT_INT_0				(IPC0bits.INT0IS)
	#define	_SIPC_INT_TIMER_1				(IPC1bits.T1IS)
	#define	_SIPC_INT_INPUT_CAPTURE_1_ERR			(IPC1bits.IC1IS)
	#define	_SIPC_INT_INPUT_CAPTURE_1			(IPC1bits.IC1IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_1			(IPC1bits.OC1IS)
	#define	_SIPC_INT_EXT_INT_1				(IPC1bits.INT1IS)
	#define	_SIPC_INT_TIMER_2				(IPC2bits.T2IS)
	#define	_SIPC_INT_INPUT_CAPTURE_2_ERR			(IPC2bits.IC2IS)
	#define	_SIPC_INT_INPUT_CAPTURE_2			(IPC2bits.IC2IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_2			(IPC2bits.OC2IS)
	#define	_SIPC_INT_EXT_INT_2				(IPC2bits.INT2IS)
	#define	_SIPC_INT_TIMER_3				(IPC3bits.T3IS)
	#define	_SIPC_INT_INPUT_CAPTURE_3_ERR			(IPC3bits.IC3IS)
	#define	_SIPC_INT_INPUT_CAPTURE_3			(IPC3bits.IC3IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_3			(IPC3bits.OC3IS)
	#define	_SIPC_INT_EXT_INT_3				(IPC3bits.INT3IS)
	#define	_SIPC_INT_TIMER_4				(IPC4bits.T4IS)
	#define	_SIPC_INT_INPUT_CAPTURE_4_ERR			(IPC4bits.IC4IS)
	#define	_SIPC_INT_INPUT_CAPTURE_4			(IPC4bits.IC4IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_4			(IPC4bits.OC4IS)
	#define	_SIPC_INT_EXT_INT_4				(IPC4bits.INT4IS)
	#define	_SIPC_INT_TIMER_5				(IPC5bits.T5IS)
	#define	_SIPC_INT_INPUT_CAPTURE_5_ERR			(IPC5bits.IC5IS)
	#define	_SIPC_INT_INPUT_CAPTURE_5			(IPC5bits.IC5IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_5			(IPC5bits.OC5IS)
	#define	_SIPC_INT_ADC_1					(IPC5bits.AD1IS)
	#define	_SIPC_INT_FAIL_SAFE_CLOCK_MON			(IPC6bits.FSCMIS)
	#define	_SIPC_INT_RTCC					(IPC6bits.RTCCIS)
	#define	_SIPC_INT_FLASH_CONTROL_EVENT			(IPC6bits.FCEIS)
	#define	_SIPC_INT_COMPARATOR_1				(IPC6bits.CMP1IS)
	#define	_SIPC_INT_COMPARATOR_2				(IPC7bits.CMP2IS)
	#define	_SIPC_INT_COMPARATOR_3				(IPC7bits.CMP3IS)
	#define	_SIPC_INT_USB					(IPC7bits.USBIS)
	#define	_SIPC_INT_SPI_1_ERR				(IPC7bits.SPI1IS)
	#define	_SIPC_INT_SPI_1_RX				(IPC7bits.SPI1IS)
	#define	_SIPC_INT_SPI_1_TX				(IPC7bits.SPI1IS)
	#define _SIPC_INT_UART_1_ERR				(IPC8bits.U1IS)
	#define _SIPC_INT_UART_1_RX				(IPC8bits.U1IS)
	#define _SIPC_INT_UART_1_TX				(IPC8bits.U1IS)
	#define	_SIPC_INT_I2C_1_COL				(IPC8bits.I2C1IS)
	#define	_SIPC_INT_I2C_1_SLAVE				(IPC8bits.I2C1IS)
	#define	_SIPC_INT_I2C_1_MASTER				(IPC8bits.I2C1IS)
	#define	_SIPC_INT_INPUT_CHANGE_PORT_A			(IPC8bits.CNIS)
	#define	_SIPC_INT_INPUT_CHANGE_PORT_B			(IPC8bits.CNIS)
	#define	_SIPC_INT_INPUT_CHANGE_PORT_C			(IPC8bits.CNIS)
	#define	_SIPC_INT_PMP					(IPC8bits.PMPIS)
	#define	_SIPC_INT_PMP_ERR				(IPC8bits.PMPIS)
	#define	_SIPC_INT_SPI_2_ERR				(IPC9bits.SPI2IS)
	#define	_SIPC_INT_SPI_2_RX				(IPC9bits.SPI2IS)
	#define	_SIPC_INT_SPI_2_TX				(IPC9bits.SPI2IS)
	#define _SIPC_INT_UART_2_ERR				(IPC9bits.U2IS)
	#define _SIPC_INT_UART_2_RX				(IPC9bits.U2IS)
	#define _SIPC_INT_UART_2_TX				(IPC9bits.U2IS)
	#define	_SIPC_INT_I2C_2_COL				(IPC9bits.I2C2IS)
	#define	_SIPC_INT_I2C_2_SLAVE				(IPC9bits.I2C2IS)
	#define	_SIPC_INT_I2C_2_MASTER				(IPC9bits.I2C2IS)
	#define	_SIPC_INT_CTMU					(IPC9bits.CTMUIS)
	#define	_SIPC_INT_DMA_0					(IPC10bits.DMA0IS)
	#define	_SIPC_INT_DMA_1					(IPC10bits.DMA1IS)
	#define	_SIPC_INT_DMA_2					(IPC10bits.DMA2IS)
	#define	_SIPC_INT_DMA_3					(IPC10bits.DMA3IS)

// Group priorities
	#define _IPC_INT_TIMER_23				_IPC_INT_TIMER_2
	#define _IPC_INT_TIMER_45				_IPC_INT_TIMER_4
	#define _IPC_INT_INPUT_CHANGE				_IPC_INT_INPUT_CHANGE_PORT_A
	#define _IPC_INT_UART_1					_IPC_INT_UART_1_ERR
	#define _IPC_INT_UART_2					_IPC_INT_UART_2_ERR
	#define _IPC_INT_SPI_1					_IPC_INT_SPI_1_ERR
	#define _IPC_INT_SPI_2					_IPC_INT_SPI_2_ERR
	#define _IPC_INT_I2C_1					_IPC_INT_I2C_1_COL
	#define _IPC_INT_I2C_2					_IPC_INT_I2C_2_COL

	#define _SIPC_INT_TIMER_23				_SIPC_INT_TIMER_2
	#define _SIPC_INT_TIMER_45				_SIPC_INT_TIMER_4
	#define _SIPC_INT_INPUT_CHANGE				_SIPC_INT_INPUT_CHANGE_PORT_A
	#define _SIPC_INT_UART_1				_SIPC_INT_UART_1_ERR
	#define _SIPC_INT_UART_2				_SIPC_INT_UART_2_ERR
	#define _SIPC_INT_SPI_1					_SIPC_INT_SPI_1_ERR
	#define _SIPC_INT_SPI_2					_SIPC_INT_SPI_2_ERR
	#define _SIPC_INT_I2C_1					_SIPC_INT_I2C_1_COL
	#define _SIPC_INT_I2C_2					_SIPC_INT_I2C_2_COL

#elif CPU_FAMILY == PIC32MX3xx || CPU_FAMILY == PIC32MX4xx
	#define	_IPC_INT_CORE_TIMER				(IPC0bits.CTIP)
	#define	_IPC_INT_CORE_SOFT_0				(IPC0bits.CS0IP)
	#define	_IPC_INT_CORE_SOFT_1				(IPC0bits.CS1IP)
	#define	_IPC_INT_EXT_INT_0				(IPC0bits.INT0IP)
	#define	_IPC_INT_TIMER_1				(IPC1bits.T1IP)
	#define	_IPC_INT_INPUT_CAPTURE_1			(IPC1bits.IC1IP)
	#define	_IPC_INT_OUTPUT_COMPARE_1			(IPC1bits.OC1IP)
	#define	_IPC_INT_EXT_INT_1				(IPC1bits.INT1IP)
	#define	_IPC_INT_TIMER_2				(IPC2bits.T2IP)
	#define	_IPC_INT_INPUT_CAPTURE_2			(IPC2bits.IC2IP)
	#define	_IPC_INT_OUTPUT_COMPARE_2			(IPC2bits.OC2IP)
	#define	_IPC_INT_EXT_INT_2				(IPC2bits.INT2IP)
	#define	_IPC_INT_TIMER_3				(IPC3bits.T3IP)
	#define	_IPC_INT_INPUT_CAPTURE_3			(IPC3bits.IC3IP)
	#define	_IPC_INT_OUTPUT_COMPARE_3			(IPC3bits.OC3IP)
	#define	_IPC_INT_EXT_INT_3				(IPC3bits.INT3IP)
	#define	_IPC_INT_TIMER_4				(IPC4bits.T4IP)
	#define	_IPC_INT_INPUT_CAPTURE_4			(IPC4bits.IC4IP)
	#define	_IPC_INT_OUTPUT_COMPARE_4			(IPC4bits.OC4IP)
	#define	_IPC_INT_EXT_INT_4				(IPC4bits.INT4IP)
	#define	_IPC_INT_TIMER_5				(IPC5bits.T5IP)
	#define	_IPC_INT_INPUT_CAPTURE_5			(IPC5bits.IC5IP)
	#define	_IPC_INT_OUTPUT_COMPARE_5			(IPC5bits.OC5IP)
	#define	_IPC_INT_SPI_1_ERR				(IPC5bits.SPI1IP)
	#define	_IPC_INT_SPI_1_RX				(IPC5bits.SPI1IP)
	#define	_IPC_INT_SPI_1_TX				(IPC5bits.SPI1IP)
	#define _IPC_INT_UART_1_ERR				(IPC6bits.U1IP)
	#define _IPC_INT_UART_1_RX				(IPC6bits.U1IP)
	#define _IPC_INT_UART_1_TX				(IPC6bits.U1IP)
	#define	_IPC_INT_I2C_1_COL				(IPC6bits.I2C1IP)
	#define	_IPC_INT_I2C_1_SLAVE				(IPC6bits.I2C1IP)
	#define	_IPC_INT_I2C_1_MASTER				(IPC6bits.I2C1IP)
	#define	_IPC_INT_INPUT_CHANGE				(IPC6bits.CNIP)
	#define	_IPC_INT_ADC_1					(IPC6bits.AD1IP)
	#define	_IPC_INT_PMP					(IPC7bits.PMPIP)
	#define	_IPC_INT_COMPARATOR_1				(IPC7bits.CMP1IP)
	#define	_IPC_INT_COMPARATOR_2				(IPC7bits.CMP2IP)
	#define	_IPC_INT_SPI_2_ERR				(IPC7bits.SPI2IP)
	#define	_IPC_INT_SPI_2_RX				(IPC7bits.SPI2IP)
	#define	_IPC_INT_SPI_2_TX				(IPC7bits.SPI2IP)
	#define _IPC_INT_UART_2_ERR				(IPC8bits.U2IP)
	#define _IPC_INT_UART_2_RX				(IPC8bits.U2IP)
	#define _IPC_INT_UART_2_TX				(IPC8bits.U2IP)
	#define	_IPC_INT_SPI_4_ERR				(IPC8bits.SPI4IP)
	#define	_IPC_INT_SPI_4_RX				(IPC8bits.SPI4IP)
	#define	_IPC_INT_SPI_4_TX				(IPC8bits.SPI4IP)
	#define	_IPC_INT_I2C_2_COL				(IPC8bits.I2C2IP)
	#define	_IPC_INT_I2C_2_SLAVE				(IPC8bits.I2C2IP)
	#define	_IPC_INT_I2C_2_MASTER				(IPC8bits.I2C2IP)
	#define	_IPC_INT_FAIL_SAFE_CLOCK_MON			(IPC8bits.FSCMIP)
	#define	_IPC_INT_RTCC					(IPC8bits.RTCCIP)
	#define	_IPC_INT_DMA_0					(IPC9bits.DMA0IP)
	#define	_IPC_INT_DMA_1					(IPC9bits.DMA1IP)
	#define	_IPC_INT_DMA_2					(IPC9bits.DMA2IP)
	#define	_IPC_INT_DMA_3					(IPC9bits.DMA3IP)
	#define	_IPC_INT_FLASH_CONTROL_EVENT			(IPC11bits.FCEIP)
	#define	_IPC_INT_USB					(IPC11bits.USBIP)


//Sub-priority
	#define	_SIPC_INT_CORE_TIMER				(IPC0bits.CTIS)
	#define	_SIPC_INT_CORE_SOFT_0				(IPC0bits.CS0IS)
	#define	_SIPC_INT_CORE_SOFT_1				(IPC0bits.CS1IS)
	#define	_SIPC_INT_EXT_INT_0				(IPC0bits.INT0IS)
	#define	_SIPC_INT_TIMER_1				(IPC1bits.T1IS)
	#define	_SIPC_INT_INPUT_CAPTURE_1			(IPC1bits.IC1IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_1			(IPC1bits.OC1IS)
	#define	_SIPC_INT_EXT_INT_1				(IPC1bits.INT1IS)
	#define	_SIPC_INT_TIMER_2				(IPC2bits.T2IS)
	#define	_SIPC_INT_INPUT_CAPTURE_2			(IPC2bits.IC2IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_2			(IPC2bits.OC2IS)
	#define	_SIPC_INT_EXT_INT_2				(IPC2bits.INT2IS)
	#define	_SIPC_INT_TIMER_3				(IPC3bits.T3IS)
	#define	_SIPC_INT_INPUT_CAPTURE_3			(IPC3bits.IC3IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_3			(IPC3bits.OC3IS)
	#define	_SIPC_INT_EXT_INT_3				(IPC3bits.INT3IS)
	#define	_SIPC_INT_TIMER_4				(IPC4bits.T4IS)
	#define	_SIPC_INT_INPUT_CAPTURE_4			(IPC4bits.IC4IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_4			(IPC4bits.OC4IS)
	#define	_SIPC_INT_EXT_INT_4				(IPC4bits.INT4IS)
	#define	_SIPC_INT_TIMER_5				(IPC5bits.T5IS)
	#define	_SIPC_INT_INPUT_CAPTURE_5			(IPC5bits.IC5IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_5			(IPC5bits.OC5IS)
	#define	_SIPC_INT_SPI_1_ERR				(IPC5bits.SPI1IS)
	#define	_SIPC_INT_SPI_1_RX				(IPC5bits.SPI1IS)
	#define	_SIPC_INT_SPI_1_TX				(IPC5bits.SPI1IS)
	#define _SIPC_INT_UART_1_ERR				(IPC6bits.U1IS)
	#define _SIPC_INT_UART_1_RX				(IPC6bits.U1IS)
	#define _SIPC_INT_UART_1_TX				(IPC6bits.U1IS)
	#define	_SIPC_INT_I2C_1_COL				(IPC6bits.I2C1IS)
	#define	_SIPC_INT_I2C_1_SLAVE				(IPC6bits.I2C1IS)
	#define	_SIPC_INT_I2C_1_MASTER				(IPC6bits.I2C1IS)
	#define	_SIPC_INT_INPUT_CHANGE				(IPC6bits.CNIS)
	#define	_SIPC_INT_ADC_1					(IPC6bits.AD1IS)
	#define	_SIPC_INT_PMP					(IPC7bits.PMPIS)
	#define	_SIPC_INT_COMPARATOR_1				(IPC7bits.CMP1IS)
	#define	_SIPC_INT_COMPARATOR_2				(IPC7bits.CMP2IS)
	#define	_SIPC_INT_SPI_2_ERR				(IPC7bits.SPI2IS)
	#define	_SIPC_INT_SPI_2_RX				(IPC7bits.SPI2IS)
	#define	_SIPC_INT_SPI_2_TX				(IPC7bits.SPI2IS)
	#define _SIPC_INT_UART_2_ERR				(IPC8bits.U2IS)
	#define _SIPC_INT_UART_2_RX				(IPC8bits.U2IS)
	#define _SIPC_INT_UART_2_TX				(IPC8bits.U2IS)
	#define	_SIPC_INT_SPI_4_ERR				(IPC8bits.SPI4IS)
	#define	_SIPC_INT_SPI_4_RX				(IPC8bits.SPI4IS)
	#define	_SIPC_INT_SPI_4_TX				(IPC8bits.SPI4IS)
	#define	_SIPC_INT_I2C_2_COL				(IPC8bits.I2C2IS)
	#define	_SIPC_INT_I2C_2_SLAVE				(IPC8bits.I2C2IS)
	#define	_SIPC_INT_I2C_2_MASTER				(IPC8bits.I2C2IS)
	#define	_SIPC_INT_FAIL_SAFE_CLOCK_MON			(IPC8bits.FSCMIS)
	#define	_SIPC_INT_RTCC					(IPC8bits.RTCCIS)
	#define	_SIPC_INT_DMA_0					(IPC9bits.DMA0IS)
	#define	_SIPC_INT_DMA_1					(IPC9bits.DMA1IS)
	#define	_SIPC_INT_DMA_2					(IPC9bits.DMA2IS)
	#define	_SIPC_INT_DMA_3					(IPC9bits.DMA3IS)
	#define	_SIPC_INT_FLASH_CONTROL_EVENT			(IPC11bits.FCEIS)
	#define	_SIPC_INT_USB					(IPC11bits.USBIS)

// Group priorities
	#define _IPC_INT_TIMER_23				_IPC_INT_TIMER_2
	#define _IPC_INT_TIMER_45				_IPC_INT_TIMER_4
	#define _IPC_INT_UART_1					_IPC_INT_UART_1_ERR
	#define _IPC_INT_UART_2					_IPC_INT_UART_2_ERR
	#define _IPC_INT_SPI_1					_IPC_INT_SPI_1_ERR
	#define _IPC_INT_SPI_2					_IPC_INT_SPI_2_ERR
	#define _IPC_INT_I2C_1					_IPC_INT_I2C_1_COL
	#define _IPC_INT_I2C_2					_IPC_INT_I2C_2_COL

