laurencedv/PIClib/lib/peripheral/pic32_interrupt.h
	#define _SIPC_INT_TIMER_23				_SIPC_INT_TIMER_2
	#define _SIPC_INT_TIMER_45				_SIPC_INT_TIMER_4
	#define _SIPC_INT_UART_1				_SIPC_INT_UART_1_ERR
	#define _SIPC_INT_UART_2				_SIPC_INT_UART_2_ERR
	#define _SIPC_INT_SPI_1					_SIPC_INT_SPI_1_ERR
	#define _SIPC_INT_SPI_2					_SIPC_INT_SPI_2_ERR
	#define _SIPC_INT_I2C_1					_SIPC_INT_I2C_1_COL
	#define _SIPC_INT_I2C_2					_SIPC_INT_I2C_2_COL
#elif CPU_FAMILY == PIC32MX5xxH || CPU_FAMILY == PIC32MX5xxL || CPU_FAMILY == PIC32MX6xx || CPU_FAMILY == PIC32MX7xx
	#define	_IPC_INT_CORE_TIMER				(IPC0bits.CTIP)
	#define	_IPC_INT_CORE_SOFT_0				(IPC0bits.CS0IP)
	#define	_IPC_INT_CORE_SOFT_1				(IPC0bits.CS1IP)
	#define	_IPC_INT_EXT_INT_0				(IPC0bits.INT0IP)
	#define	_IPC_INT_TIMER_1				(IPC1bits.T1IP)
	#define	_IPC_INT_INPUT_CAPTURE_1_ERR			(IPC1bits.IC1IP)
	#define	_IPC_INT_INPUT_CAPTURE_1			(IPC1bits.IC1IP)
	#define	_IPC_INT_OUTPUT_COMPARE_1			(IPC1bits.OC1IP)
	#define	_IPC_INT_EXT_INT_1				(IPC1bits.INT1IP)
	#define	_IPC_INT_TIMER_2				(IPC2bits.T2IP)
	#define	_IPC_INT_INPUT_CAPTURE_2_ERR			(IPC2bits.IC2IP)
	#define	_IPC_INT_INPUT_CAPTURE_2			(IPC2bits.IC2IP)
	#define	_IPC_INT_OUTPUT_COMPARE_2			(IPC2bits.OC2IP)
	#define	_IPC_INT_EXT_INT_2				(IPC2bits.INT2IP)
	#define	_IPC_INT_TIMER_3				(IPC3bits.T3IP)
	#define	_IPC_INT_INPUT_CAPTURE_3_ERR			(IPC3bits.IC3IP)
	#define	_IPC_INT_INPUT_CAPTURE_3			(IPC3bits.IC3IP)
	#define	_IPC_INT_OUTPUT_COMPARE_3			(IPC3bits.OC3IP)
	#define	_IPC_INT_EXT_INT_3				(IPC3bits.INT3IP)
	#define	_IPC_INT_TIMER_4				(IPC4bits.T4IP)
	#define	_IPC_INT_INPUT_CAPTURE_4_ERR			(IPC4bits.IC4IP)
	#define	_IPC_INT_INPUT_CAPTURE_4			(IPC4bits.IC4IP)
	#define	_IPC_INT_OUTPUT_COMPARE_4			(IPC4bits.OC4IP)
	#define	_IPC_INT_EXT_INT_4				(IPC4bits.INT4IP)
	#define	_IPC_INT_TIMER_5				(IPC5bits.T5IP)
	#define	_IPC_INT_INPUT_CAPTURE_5_ERR			(IPC5bits.IC5IP)
	#define	_IPC_INT_INPUT_CAPTURE_5			(IPC5bits.IC5IP)
	#define	_IPC_INT_OUTPUT_COMPARE_5			(IPC5bits.OC5IP)
	#define	_IPC_INT_SPI_1_ERR				(IPC5bits.SPI1IP)
	#define	_IPC_INT_SPI_1_RX				(IPC5bits.SPI1IP)
	#define	_IPC_INT_SPI_1_TX				(IPC5bits.SPI1IP)
	#define _IPC_INT_UART_1_ERR				(IPC6bits.U1IP)
	#define _IPC_INT_UART_1_RX				(IPC6bits.U1IP)
	#define _IPC_INT_UART_1_TX				(IPC6bits.U1IP)
	#define	_IPC_INT_SPI_3_ERR				(IPC6bits.SPI3IP)
	#define	_IPC_INT_SPI_3_RX				(IPC6bits.SPI3IP)
	#define	_IPC_INT_SPI_3_TX				(IPC6bits.SPI3IP)
	#define	_IPC_INT_I2C_3_COL				(IPC6bits.I2C3IP)
	#define	_IPC_INT_I2C_3_SLAVE				(IPC6bits.I2C3IP)
	#define	_IPC_INT_I2C_3_MASTER				(IPC6bits.I2C3IP)
	#define	_IPC_INT_I2C_1_COL				(IPC6bits.I2C1IP)
	#define	_IPC_INT_I2C_1_SLAVE				(IPC6bits.I2C1IP)
	#define	_IPC_INT_I2C_1_MASTER				(IPC6bits.I2C1IP)
	#define	_IPC_INT_INPUT_CHANGE				(IPC6bits.CNIP)
	#define	_IPC_INT_ADC_1					(IPC6bits.AD1IP)
	#define	_IPC_INT_PMP					(IPC7bits.PMPIP)
	#define	_IPC_INT_PMP_ERR				(IPC7bits.PMPIP)
	#define	_IPC_INT_COMPARATOR_1				(IPC7bits.CMP1IP)
	#define	_IPC_INT_COMPARATOR_2				(IPC7bits.CMP2IP)
	#define _IPC_INT_UART_3_ERR				(IPC7bits.U3IP)
	#define _IPC_INT_UART_3_RX				(IPC7bits.U3IP)
	#define _IPC_INT_UART_3_TX				(IPC7bits.U3IP)
	#define	_IPC_INT_SPI_2_ERR				(IPC7bits.SPI2IP)
	#define	_IPC_INT_SPI_2_RX				(IPC7bits.SPI2IP)
	#define	_IPC_INT_SPI_2_TX				(IPC7bits.SPI2IP)
	#define	_IPC_INT_I2C_4_COL				(IPC7bits.I2C4IP)
	#define	_IPC_INT_I2C_4_SLAVE				(IPC7bits.I2C4IP)
	#define	_IPC_INT_I2C_4_MASTER				(IPC7bits.I2C4IP)
	#define _IPC_INT_UART_2_ERR				(IPC8bits.U2IP)
	#define _IPC_INT_UART_2_RX				(IPC8bits.U2IP)
	#define _IPC_INT_UART_2_TX				(IPC8bits.U2IP)
	#define	_IPC_INT_SPI_4_ERR				(IPC8bits.SPI4IP)
	#define	_IPC_INT_SPI_4_RX				(IPC8bits.SPI4IP)
	#define	_IPC_INT_SPI_4_TX				(IPC8bits.SPI4IP)
	#define	_IPC_INT_I2C_5_COL				(IPC8bits.I2C5IP)
	#define	_IPC_INT_I2C_5_SLAVE				(IPC8bits.I2C5IP)
	#define	_IPC_INT_I2C_5_MASTER				(IPC8bits.I2C5IP)
	#define	_IPC_INT_I2C_2_COL				(IPC8bits.I2C2IP)
	#define	_IPC_INT_I2C_2_SLAVE				(IPC8bits.I2C2IP)
	#define	_IPC_INT_I2C_2_MASTER				(IPC8bits.I2C2IP)
	#define	_IPC_INT_FAIL_SAFE_CLOCK_MON			(IPC8bits.FSCMIP)
	#define	_IPC_INT_RTCC					(IPC8bits.RTCCIP)
	#define	_IPC_INT_DMA_0					(IPC9bits.DMA0IP)
	#define	_IPC_INT_DMA_1					(IPC9bits.DMA1IP)
	#define	_IPC_INT_DMA_2					(IPC9bits.DMA2IP)
	#define	_IPC_INT_DMA_3					(IPC9bits.DMA3IP)
	#define	_IPC_INT_DMA_4					(IPC10bits.DMA4IP)
	#define	_IPC_INT_DMA_5					(IPC10bits.DMA5IP)
	#define	_IPC_INT_DMA_6					(IPC10bits.DMA6IP)
	#define	_IPC_INT_DMA_7					(IPC10bits.DMA7IP)
	#define	_IPC_INT_FLASH_CONTROL_EVENT			(IPC11bits.FCEIP)
	#define	_IPC_INT_USB					(IPC11bits.USBIP)
	#define	_IPC_INT_CAN_1					(IPC11bits.CAN1IP)
	#define	_IPC_INT_CAN_2					(IPC11bits.CAN2IP)
	#define	_IPC_INT_ETHERNET				(IPC12bits.ETHIP)
	#define _IPC_INT_UART_4_ERR				(IPC12bits.U4IP)
	#define _IPC_INT_UART_4_RX				(IPC12bits.U4IP)
	#define _IPC_INT_UART_4_TX				(IPC12bits.U4IP)
	#define _IPC_INT_UART_6_ERR				(IPC12bits.U6IP)
	#define _IPC_INT_UART_6_RX				(IPC12bits.U6IP)
	#define _IPC_INT_UART_6_TX				(IPC12bits.U6IP)
	#define _IPC_INT_UART_5_ERR				(IPC12bits.U5IP)
	#define _IPC_INT_UART_5_RX				(IPC12bits.U5IP)
	#define _IPC_INT_UART_5_TX				(IPC12bits.U5IP)


//Sub-priority
	#define	_SIPC_INT_CORE_TIMER				(IPC0bits.CTIS)
	#define	_SIPC_INT_CORE_SOFT_0				(IPC0bits.CS0IS)
	#define	_SIPC_INT_CORE_SOFT_1				(IPC0bits.CS1IS)
	#define	_SIPC_INT_EXT_INT_0				(IPC0bits.INT0IS)
	#define	_SIPC_INT_TIMER_1				(IPC1bits.T1IS)
	#define	_SIPC_INT_INPUT_CAPTURE_1_ERR			(IPC1bits.IC1IS)
	#define	_SIPC_INT_INPUT_CAPTURE_1			(IPC1bits.IC1IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_1			(IPC1bits.OC1IS)
	#define	_SIPC_INT_EXT_INT_1				(IPC1bits.INT1IS)
	#define	_SIPC_INT_TIMER_2				(IPC2bits.T2IS)
	#define	_SIPC_INT_INPUT_CAPTURE_2_ERR			(IPC2bits.IC2IS)
	#define	_SIPC_INT_INPUT_CAPTURE_2			(IPC2bits.IC2IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_2			(IPC2bits.OC2IS)
	#define	_SIPC_INT_EXT_INT_2				(IPC2bits.INT2IS)
	#define	_SIPC_INT_TIMER_3				(IPC3bits.T3IS)
	#define	_SIPC_INT_INPUT_CAPTURE_3_ERR			(IPC3bits.IC3IS)
	#define	_SIPC_INT_INPUT_CAPTURE_3			(IPC3bits.IC3IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_3			(IPC3bits.OC3IS)
	#define	_SIPC_INT_EXT_INT_3				(IPC3bits.INT3IS)
	#define	_SIPC_INT_TIMER_4				(IPC4bits.T4IS)
	#define	_SIPC_INT_INPUT_CAPTURE_4_ERR			(IPC4bits.IC4IS)
	#define	_SIPC_INT_INPUT_CAPTURE_4			(IPC4bits.IC4IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_4			(IPC4bits.OC4IS)
	#define	_SIPC_INT_EXT_INT_4				(IPC4bits.INT4IS)
	#define	_SIPC_INT_TIMER_5				(IPC5bits.T5IS)
	#define	_SIPC_INT_INPUT_CAPTURE_5_ERR			(IPC5bits.IC5IS)
	#define	_SIPC_INT_INPUT_CAPTURE_5			(IPC5bits.IC5IS)
	#define	_SIPC_INT_OUTPUT_COMPARE_5			(IPC5bits.OC5IS)
	#define	_SIPC_INT_SPI_1_ERR				(IPC5bits.SPI1IS)
	#define	_SIPC_INT_SPI_1_RX				(IPC5bits.SPI1IS)
	#define	_SIPC_INT_SPI_1_TX				(IPC5bits.SPI1IS)
	#define _SIPC_INT_UART_1_ERR				(IPC6bits.U1IS)
	#define _SIPC_INT_UART_1_RX				(IPC6bits.U1IS)
	#define _SIPC_INT_UART_1_TX				(IPC6bits.U1IS)
	#define	_SIPC_INT_SPI_3_ERR				(IPC6bits.SPI3IS)
	#define	_SIPC_INT_SPI_3_RX				(IPC6bits.SPI3IS)
	#define	_SIPC_INT_SPI_3_TX				(IPC6bits.SPI3IS)
	#define	_SIPC_INT_I2C_3_COL				(IPC6bits.I2C3IS)
	#define	_SIPC_INT_I2C_3_SLAVE				(IPC6bits.I2C3IS)
	#define	_SIPC_INT_I2C_3_MASTER				(IPC6bits.I2C3IS)
	#define	_SIPC_INT_I2C_1_COL				(IPC6bits.I2C1IS)
	#define	_SIPC_INT_I2C_1_SLAVE				(IPC6bits.I2C1IS)
	#define	_SIPC_INT_I2C_1_MASTER				(IPC6bits.I2C1IS)
	#define	_SIPC_INT_INPUT_CHANGE				(IPC6bits.CNIS)
	#define	_SIPC_INT_ADC_1					(IPC6bits.AD1IS)
	#define	_SIPC_INT_PMP					(IPC7bits.PMPIS)
	#define	_SIPC_INT_PMP_ERR				(IPC7bits.PMPIS)
	#define	_SIPC_INT_COMPARATOR_1				(IPC7bits.CMP1IS)
	#define	_SIPC_INT_COMPARATOR_2				(IPC7bits.CMP2IS)
	#define _SIPC_INT_UART_3_ERR				(IPC7bits.U3IS)
	#define _SIPC_INT_UART_3_RX				(IPC7bits.U3IS)
	#define _SIPC_INT_UART_3_TX				(IPC7bits.U3IS)
	#define	_SIPC_INT_SPI_2_ERR				(IPC7bits.SPI2IS)
	#define	_SIPC_INT_SPI_2_RX				(IPC7bits.SPI2IS)
	#define	_SIPC_INT_SPI_2_TX				(IPC7bits.SPI2IS)
	#define	_SIPC_INT_I2C_4_COL				(IPC7bits.I2C4IS)
	#define	_SIPC_INT_I2C_4_SLAVE				(IPC7bits.I2C4IS)
	#define	_SIPC_INT_I2C_4_MASTER				(IPC7bits.I2C4IS)
	#define _SIPC_INT_UART_2_ERR				(IPC8bits.U2IS)
	#define _SIPC_INT_UART_2_RX				(IPC8bits.U2IS)
	#define _SIPC_INT_UART_2_TX				(IPC8bits.U2IS)
	#define	_SIPC_INT_SPI_4_ERR				(IPC8bits.SPI4IS)
	#define	_SIPC_INT_SPI_4_RX				(IPC8bits.SPI4IS)
	#define	_SIPC_INT_SPI_4_TX				(IPC8bits.SPI4IS)
	#define	_SIPC_INT_I2C_5_COL				(IPC8bits.I2C5IS)
	#define	_SIPC_INT_I2C_5_SLAVE				(IPC8bits.I2C5IS)
	#define	_SIPC_INT_I2C_5_MASTER				(IPC8bits.I2C5IS)
	#define	_SIPC_INT_I2C_2_COL				(IPC8bits.I2C2IS)
	#define	_SIPC_INT_I2C_2_SLAVE				(IPC8bits.I2C2IS)
	#define	_SIPC_INT_I2C_2_MASTER				(IPC8bits.I2C2IS)
	#define	_SIPC_INT_FAIL_SAFE_CLOCK_MON			(IPC8bits.FSCMIS)
	#define	_SIPC_INT_RTCC					(IPC8bits.RTCCIS)
	#define	_SIPC_INT_DMA_0					(IPC9bits.DMA0IS)
	#define	_SIPC_INT_DMA_1					(IPC9bits.DMA1IS)
	#define	_SIPC_INT_DMA_2					(IPC9bits.DMA2IS)
	#define	_SIPC_INT_DMA_3					(IPC9bits.DMA3IS)
	#define	_SIPC_INT_DMA_4					(IPC10bits.DMA4IS)
	#define	_SIPC_INT_DMA_5					(IPC10bits.DMA5IS)
	#define	_SIPC_INT_DMA_6					(IPC10bits.DMA6IS)
	#define	_SIPC_INT_DMA_7					(IPC10bits.DMA7IS)
	#define	_SIPC_INT_FLASH_CONTROL_EVENT			(IPC11bits.FCEIS)
	#define	_SIPC_INT_USB					(IPC11bits.USBIS)
	#define	_SIPC_INT_CAN_1					(IPC11bits.CAN1IS)
	#define	_SIPC_INT_CAN_2					(IPC11bits.CAN2IS)
	#define	_SIPC_INT_ETHERNET				(IPC12bits.ETHIS)
	#define _SIPC_INT_UART_4_ERR				(IPC12bits.U4IS)
	#define _SIPC_INT_UART_4_RX				(IPC12bits.U4IS)
	#define _SIPC_INT_UART_4_TX				(IPC12bits.U4IS)
	#define _SIPC_INT_UART_6_ERR				(IPC12bits.U6IS)
	#define _SIPC_INT_UART_6_RX				(IPC12bits.U6IS)
	#define _SIPC_INT_UART_6_TX				(IPC12bits.U6IS)
	#define _SIPC_INT_UART_5_ERR				(IPC12bits.U5IS)
	#define _SIPC_INT_UART_5_RX				(IPC12bits.U5IS)
	#define _SIPC_INT_UART_5_TX				(IPC12bits.U5IS)

// Group priorities
	#define _IPC_INT_TIMER_23				_IPC_INT_TIMER_2
	#define _IPC_INT_TIMER_45				_IPC_INT_TIMER_4
	#define _IPC_INT_UART_1					_IPC_INT_UART_1_ERR
	#define _IPC_INT_UART_2					_IPC_INT_UART_2_ERR
	#define _IPC_INT_UART_3					_IPC_INT_UART_3_ERR
	#define _IPC_INT_UART_4					_IPC_INT_UART_4_ERR
	#define _IPC_INT_UART_5					_IPC_INT_UART_5_ERR
	#define _IPC_INT_UART_6					_IPC_INT_UART_6_ERR
	#define _IPC_INT_SPI_1					_IPC_INT_SPI_1_ERR
	#define _IPC_INT_SPI_2					_IPC_INT_SPI_2_ERR
	#define _IPC_INT_SPI_3					_IPC_INT_SPI_3_ERR
	#define _IPC_INT_SPI_4					_IPC_INT_SPI_4_ERR
	#define _IPC_INT_I2C_1					_IPC_INT_I2C_1_COL
	#define _IPC_INT_I2C_2					_IPC_INT_I2C_2_COL
	#define _IPC_INT_I2C_3					_IPC_INT_I2C_3_COL
	#define _IPC_INT_I2C_4					_IPC_INT_I2C_4_COL
	#define _IPC_INT_I2C_5					_IPC_INT_I2C_5_COL

	#define _SIPC_INT_TIMER_23				_SIPC_INT_TIMER_2
	#define _SIPC_INT_TIMER_45				_SIPC_INT_TIMER_4
	#define _SIPC_INT_UART_1				_SIPC_INT_UART_1_ERR
	#define _SIPC_INT_UART_2				_SIPC_INT_UART_2_ERR
	#define _SIPC_INT_UART_3				_SIPC_INT_UART_3_ERR
	#define _SIPC_INT_UART_4				_SIPC_INT_UART_4_ERR
	#define _SIPC_INT_UART_5				_SIPC_INT_UART_5_ERR
	#define _SIPC_INT_UART_6				_SIPC_INT_UART_6_ERR
	#define _SIPC_INT_SPI_1					_SIPC_INT_SPI_1_ERR
	#define _SIPC_INT_SPI_2					_SIPC_INT_SPI_2_ERR
	#define _SIPC_INT_SPI_3					_SIPC_INT_SPI_3_ERR
	#define _SIPC_INT_SPI_4					_SIPC_INT_SPI_4_ERR
	#define _SIPC_INT_I2C_1					_SIPC_INT_I2C_1_COL
	#define _SIPC_INT_I2C_2					_SIPC_INT_I2C_2_COL
	#define _SIPC_INT_I2C_3					_SIPC_INT_I2C_3_COL
	#define _SIPC_INT_I2C_4					_SIPC_INT_I2C_4_COL
	#define _SIPC_INT_I2C_5					_SIPC_INT_I2C_5_COL
#endif
// ------------------------- //

// -- Interrupts Mask -- //
#if CPU_FAMILY == PIC32MX1xx || CPU_FAMILY == PIC32MX2xx
//Individual mask
	#define _MASK_INT_CORE_TIMER				BIT0
	#define _MASK_INT_CORE_SOFT_0				BIT1
	#define _MASK_INT_CORE_SOFT_1				BIT2
	#define _MASK_INT_EXT_INT_0				BIT3
	#define _MASK_INT_TIMER_1				BIT4
	#define _MASK_INT_INPUT_CAPTURE_1_ERR			BIT5
	#define _MASK_INT_INPUT_CAPTURE_1			BIT6
	#define _MASK_INT_OUTPUT_COMPARE_1			BIT7
	#define _MASK_INT_EXT_INT_1				BIT8
	#define _MASK_INT_TIMER_2				BIT9
	#define _MASK_INT_INPUT_CAPTURE_2_ERR			BIT10
	#define _MASK_INT_INPUT_CAPTURE_2			BIT11
	#define _MASK_INT_OUTPUT_COMPARE_2			BIT12
	#define _MASK_INT_EXT_INT_2				BIT13
	#define _MASK_INT_TIMER_3				BIT14
	#define _MASK_INT_INPUT_CAPTURE_3_ERR			BIT15
	#define _MASK_INT_INPUT_CAPTURE_3			BIT16
	#define _MASK_INT_OUTPUT_COMPARE_3			BIT17
	#define _MASK_INT_EXT_INT_3				BIT18
	#define _MASK_INT_TIMER_4				BIT19
	#define _MASK_INT_INPUT_CAPTURE_4_ERR			BIT20
	#define _MASK_INT_INPUT_CAPTURE_4			BIT21
	#define _MASK_INT_OUTPUT_COMPARE_4			BIT22
	#define _MASK_INT_EXT_INT_4				BIT23
	#define _MASK_INT_TIMER_5				BIT24
	#define _MASK_INT_INPUT_CAPTURE_5_ERR			BIT25
	#define _MASK_INT_INPUT_CAPTURE_5			BIT26
	#define _MASK_INT_OUTPUT_COMPARE_5			BIT27
	#define _MASK_INT_ADC_1					BIT28
	#define _MASK_INT_FAIL_SAFE_CLOCK_MON			BIT29
	#define _MASK_INT_RTCC					BIT30
	#define _MASK_INT_FLASH_CONTROL_EVENT			BIT31
	#define _MASK_INT_COMPARATOR_1				BIT0
	#define _MASK_INT_COMPARATOR_2				BIT1
	#define _MASK_INT_COMPARATOR_3				BIT2
	#define _MASK_INT_USB					BIT3
	#define _MASK_INT_SPI_1_ERR				BIT4
	#define _MASK_INT_SPI_1_RX				BIT5
	#define _MASK_INT_SPI_1_TX				BIT6
	#define _MASK_INT_UART_1_ERR				BIT7
	#define _MASK_INT_UART_1_RX				BIT8
	#define _MASK_INT_UART_1_TX				BIT9
	#define _MASK_INT_I2C_1_COL				BIT10
	#define _MASK_INT_I2C_1_SLAVE				BIT11
	#define _MASK_INT_I2C_1_MASTER				BIT12
	#define _MASK_INT_INPUT_CHANGE_PORT_A			BIT13
	#define _MASK_INT_INPUT_CHANGE_PORT_B			BIT14
	#define _MASK_INT_INPUT_CHANGE_PORT_C			BIT15
	#define _MASK_INT_PMP					BIT16
	#define _MASK_INT_PMP_ERR				BIT17
	#define _MASK_INT_SPI_2_ERR				BIT18
	#define _MASK_INT_SPI_2_RX				BIT19
	#define _MASK_INT_SPI_2_TX				BIT20
	#define _MASK_INT_UART_2_ERR				BIT21
	#define _MASK_INT_UART_2_RX				BIT22
	#define _MASK_INT_UART_2_TX				BIT23
	#define _MASK_INT_I2C_2_COL				BIT24
	#define _MASK_INT_I2C_2_SLAVE				BIT25
	#define _MASK_INT_I2C_2_MASTER				BIT26
	#define _MASK_INT_CTMU					BIT27
	#define _MASK_INT_DMA_0					BIT28
	#define _MASK_INT_DMA_1					BIT29
	#define _MASK_INT_DMA_2					BIT30
	#define _MASK_INT_DMA_3					BIT31

//Group mask
	#define _MASK_INT_TIMER_23				_MASK_INT_TIMER_2|_MASK_INT_TIMER_3
	#define _MASK_INT_TIMER_45				_MASK_INT_TIMER_4|_MASK_INT_TIMER_5
	#define _MASK_INT_INPUT_CHANGE				_MASK_INT_INPUT_CHANGE_PORT_A|_MASK_INT_INPUT_CHANGE_PORT_B|_MASK_INT_INPUT_CHANGE_PORT_C
	#define _MASK_INT_UART_1				_MASK_INT_UART_1_ERR|_MASK_INT_UART_1_RX|_MASK_INT_UART_1_TX
	#define _MASK_INT_UART_2				_MASK_INT_UART_2_ERR|_MASK_INT_UART_2_RX|_MASK_INT_UART_2_TX
	#define _MASK_INT_SPI_1					_MASK_INT_SPI_1_ERR|_MASK_INT_SPI_1_RX|_MASK_INT_SPI_1_TX
	#define _MASK_INT_SPI_2					_MASK_INT_SPI_2_ERR|_MASK_INT_SPI_2_RX|_MASK_INT_SPI_2_TX
	#define _MASK_INT_I2C_1					_MASK_INT_I2C_1_COL|_MASK_INT_I2C_1_SLAVE|_MASK_INT_I2C_1_MASTER
	#define _MASK_INT_I2C_2					_MASK_INT_I2C_2_COL|_MASK_INT_I2C_2_SLAVE|_MASK_INT_I2C_2_MASTER

#elif CPU_FAMILY == PIC32MX3xx || CPU_FAMILY == PIC32MX4xx
//Individual mask
	#define _MASK_INT_CORE_TIMER				BIT0
	#define _MASK_INT_CORE_SOFT_0				BIT1
	#define _MASK_INT_CORE_SOFT_1				BIT2
	#define _MASK_INT_EXT_INT_0				BIT3
	#define _MASK_INT_TIMER_1				BIT4
	#define _MASK_INT_INPUT_CAPTURE_1			BIT5
	#define _MASK_INT_OUTPUT_COMPARE_1			BIT6
	#define _MASK_INT_EXT_INT_1				BIT7
	#define _MASK_INT_TIMER_2				BIT8
	#define _MASK_INT_INPUT_CAPTURE_2			BIT9
	#define _MASK_INT_OUTPUT_COMPARE_2			BIT10
	#define _MASK_INT_EXT_INT_2				BIT11
	#define _MASK_INT_TIMER_3				BIT12
	#define _MASK_INT_INPUT_CAPTURE_3			BIT13
	#define _MASK_INT_OUTPUT_COMPARE_3			BIT14
	#define _MASK_INT_EXT_INT_3				BIT15
	#define _MASK_INT_TIMER_4				BIT16
	#define _MASK_INT_INPUT_CAPTURE_4			BIT17
	#define _MASK_INT_OUTPUT_COMPARE_4			BIT18
	#define _MASK_INT_EXT_INT_4				BIT19
	#define _MASK_INT_TIMER_5				BIT20
	#define _MASK_INT_INPUT_CAPTURE_5			BIT21
	#define _MASK_INT_OUTPUT_COMPARE_5			BIT22
	#define _MASK_INT_SPI_1_ERR				BIT23
	#define _MASK_INT_SPI_1_RX				BIT24
	#define _MASK_INT_SPI_1_TX				BIT25
	#define _MASK_INT_UART_1_ERR				BIT26
	#define _MASK_INT_UART_1_RX				BIT27
	#define _MASK_INT_UART_1_TX				BIT28
	#define _MASK_INT_I2C_1_COL				BIT29
	#define _MASK_INT_I2C_1_SLAVE				BIT30
	#define _MASK_INT_I2C_1_MASTER				BIT31
	#define _MASK_INT_INPUT_CHANGE				BIT0
	#define _MASK_INT_ADC_1					BIT1
	#define _MASK_INT_PMP					BIT2
	#define _MASK_INT_COMPARATOR_1				BIT3
	#define _MASK_INT_COMPARATOR_2				BIT4
	#define _MASK_INT_SPI_2_ERR				BIT5
	#define _MASK_INT_SPI_2_RX				BIT6
	#define _MASK_INT_SPI_2_TX				BIT7
	#define _MASK_INT_UART_2_ERR				BIT8
	#define _MASK_INT_UART_2_RX				BIT9
	#define _MASK_INT_UART_2_TX				BIT10
	#define _MASK_INT_I2C_2_COL				BIT11
	#define _MASK_INT_I2C_2_SLAVE				BIT12
	#define _MASK_INT_I2C_2_MASTER				BIT13
	#define _MASK_INT_FAIL_SAFE_CLOCK_MON			BIT14
	#define _MASK_INT_RTCC					BIT15
	#define _MASK_INT_DMA_0					BIT16
	#define _MASK_INT_DMA_1					BIT17
	#define _MASK_INT_DMA_2					BIT18
	#define _MASK_INT_DMA_3					BIT19
	#define _MASK_INT_FLASH_CONTROL_EVENT			BIT24
	#define _MASK_INT_USB					BIT25

//Group mask
	#define _MASK_INT_TIMER_23				_MASK_INT_TIMER_2|_MASK_INT_TIMER_3
	#define _MASK_INT_TIMER_45				_MASK_INT_TIMER_4|_MASK_INT_TIMER_5
	#define _MASK_INT_UART_1				_MASK_INT_UART_1_ERR|_MASK_INT_UART_1_RX|_MASK_INT_UART_1_TX
	#define _MASK_INT_UART_2				_MASK_INT_UART_2_ERR|_MASK_INT_UART_2_RX|_MASK_INT_UART_2_TX
	#define _MASK_INT_SPI_1					_MASK_INT_SPI_1_ERR|_MASK_INT_SPI_1_RX|_MASK_INT_SPI_1_TX
	#define _MASK_INT_SPI_2					_MASK_INT_SPI_2_ERR|_MASK_INT_SPI_2_RX|_MASK_INT_SPI_2_TX
	#define _MASK_INT_I2C_1					_MASK_INT_I2C_1_COL|_MASK_INT_I2C_1_SLAVE|_MASK_INT_I2C_1_MASTER
	#define _MASK_INT_I2C_2					_MASK_INT_I2C_2_COL|_MASK_INT_I2C_2_SLAVE|_MASK_INT_I2C_2_MASTER

#elif CPU_FAMILY == PIC32MX5xxH || CPU_FAMILY == PIC32MX5xxL || CPU_FAMILY == PIC32MX6xx || CPU_FAMILY == PIC32MX7xx
//Individual mask
	#define _MASK_INT_CORE_TIMER				BIT0
	#define _MASK_INT_CORE_SOFT_0				BIT1
	#define _MASK_INT_CORE_SOFT_1				BIT2
	#define _MASK_INT_EXT_INT_0				BIT3
	#define _MASK_INT_TIMER_1				BIT4
	#define _MASK_INT_INPUT_CAPTURE_1			BIT5
	#define _MASK_INT_OUTPUT_COMPARE_1			BIT6
	#define _MASK_INT_EXT_INT_1				BIT7
	#define _MASK_INT_TIMER_2				BIT8
	#define _MASK_INT_INPUT_CAPTURE_2			BIT9
	#define _MASK_INT_OUTPUT_COMPARE_2			BIT10
	#define _MASK_INT_EXT_INT_2				BIT11
	#define _MASK_INT_TIMER_3				BIT12
	#define _MASK_INT_INPUT_CAPTURE_3			BIT13
	#define _MASK_INT_OUTPUT_COMPARE_3			BIT14
	#define _MASK_INT_EXT_INT_3				BIT15
	#define _MASK_INT_TIMER_4				BIT16
	#define _MASK_INT_INPUT_CAPTURE_4			BIT17
	#define _MASK_INT_OUTPUT_COMPARE_4			BIT18
	#define _MASK_INT_EXT_INT_4				BIT19
	#define _MASK_INT_TIMER_5				BIT20
	#define _MASK_INT_INPUT_CAPTURE_5			BIT21
	#define _MASK_INT_OUTPUT_COMPARE_5			BIT22
	#define _MASK_INT_SPI_1_ERR				BIT23
	#define _MASK_INT_SPI_1_RX				BIT24
	#define _MASK_INT_SPI_1_TX				BIT25
	#define _MASK_INT_UART_1_ERR				BIT26
	#define _MASK_INT_UART_1_RX				BIT27
	#define _MASK_INT_UART_1_TX				BIT28
	#define _MASK_INT_SPI_3_ERR				BIT26
	#define _MASK_INT_SPI_3_RX				BIT27
	#define _MASK_INT_SPI_3_TX				BIT28
	#define _MASK_INT_I2C_3_COL				BIT26
	#define _MASK_INT_I2C_3_SLAVE				BIT27
	#define _MASK_INT_I2C_3_MASTER				BIT28
	#define _MASK_INT_I2C_1_COL				BIT29
	#define _MASK_INT_I2C_1_SLAVE				BIT30
	#define _MASK_INT_I2C_1_MASTER				BIT31
	#define _MASK_INT_INPUT_CHANGE				BIT0
	#define _MASK_INT_ADC_1					BIT1
	#define _MASK_INT_PMP					BIT2
	#define _MASK_INT_COMPARATOR_1				BIT3
	#define _MASK_INT_COMPARATOR_2				BIT4
	#define _MASK_INT_UART_3_ERR				BIT5
	#define _MASK_INT_UART_3_RX				BIT6
	#define _MASK_INT_UART_3_TX				BIT7
	#define _MASK_INT_SPI_2_ERR				BIT5
	#define _MASK_INT_SPI_2_RX				BIT6
	#define _MASK_INT_SPI_2_TX				BIT7
	#define _MASK_INT_I2C_4_COL				BIT5
	#define _MASK_INT_I2C_4_SLAVE				BIT6
	#define _MASK_INT_I2C_4_MASTER				BIT7
	#define _MASK_INT_UART_2_ERR				BIT8
	#define _MASK_INT_UART_2_RX				BIT9
	#define _MASK_INT_UART_2_TX				BIT10
	#define _MASK_INT_SPI_4_ERR				BIT8
	#define _MASK_INT_SPI_4_RX				BIT9
	#define _MASK_INT_SPI_4_TX				BIT10
	#define _MASK_INT_I2C_5_COL				BIT8
	#define _MASK_INT_I2C_5_SLAVE				BIT9
	#define _MASK_INT_I2C_5_MASTER				BIT10
	#define _MASK_INT_I2C_2_COL				BIT11
	#define _MASK_INT_I2C_2_SLAVE				BIT12
	#define _MASK_INT_I2C_2_MASTER				BIT13
	#define _MASK_INT_FAIL_SAFE_CLOCK_MON			BIT14
	#define _MASK_INT_RTCC					BIT15
	#define _MASK_INT_DMA_0					BIT16
	#define _MASK_INT_DMA_1					BIT17
	#define _MASK_INT_DMA_2					BIT18
	#define _MASK_INT_DMA_3					BIT19
	#define _MASK_INT_DMA_4					BIT20
	#define _MASK_INT_DMA_5					BIT21
	#define _MASK_INT_DMA_6					BIT22
	#define _MASK_INT_DMA_7					BIT23
	#define _MASK_INT_FLASH_CONTROL_EVENT			BIT24
	#define _MASK_INT_USB					BIT25
	#define _MASK_INT_CAN_1					BIT26
	#define _MASK_INT_CAN_2					BIT27
	#define _MASK_INT_ETHERNET				BIT28
	#define _MASK_INT_INPUT_CAPTURE_1_ERR			BIT29
	#define _MASK_INT_INPUT_CAPTURE_2_ERR			BIT30
	#define _MASK_INT_INPUT_CAPTURE_3_ERR			BIT31
	#define _MASK_INT_INPUT_CAPTURE_4_ERR			BIT0
	#define _MASK_INT_INPUT_CAPTURE_5_ERR			BIT1
	#define _MASK_INT_PMP_ERR				BIT2
	#define _MASK_INT_UART_4_ERR				BIT3
	#define _MASK_INT_UART_4_RX				BIT4
	#define _MASK_INT_UART_4_TX				BIT5
	#define _MASK_INT_UART_6_ERR				BIT6
	#define _MASK_INT_UART_6_RX				BIT7
	#define _MASK_INT_UART_6_TX				BIT8
	#define _MASK_INT_UART_5_ERR				BIT9
	#define _MASK_INT_UART_5_RX				BIT10
	#define _MASK_INT_UART_5_TX				BIT11

//Group mask
	#define _MASK_INT_TIMER_23				_MASK_INT_TIMER_2|_MASK_INT_TIMER_3
	#define _MASK_INT_TIMER_45				_MASK_INT_TIMER_4|_MASK_INT_TIMER_5
	#define _MASK_INT_UART_1				_MASK_INT_UART_1_ERR|_MASK_INT_UART_1_RX|_MASK_INT_UART_1_TX
	#define _MASK_INT_UART_2				_MASK_INT_UART_2_ERR|_MASK_INT_UART_2_RX|_MASK_INT_UART_2_TX
	#define _MASK_INT_UART_3				_MASK_INT_UART_3_ERR|_MASK_INT_UART_3_RX|_MASK_INT_UART_3_TX
	#define _MASK_INT_UART_4				_MASK_INT_UART_4_ERR|_MASK_INT_UART_4_RX|_MASK_INT_UART_4_TX
	#define _MASK_INT_UART_5				_MASK_INT_UART_5_ERR|_MASK_INT_UART_5_RX|_MASK_INT_UART_5_TX
	#define _MASK_INT_UART_6				_MASK_INT_UART_6_ERR|_MASK_INT_UART_6_RX|_MASK_INT_UART_6_TX
	#define _MASK_INT_SPI_1					_MASK_INT_SPI_1_ERR|_MASK_INT_SPI_1_RX|_MASK_INT_SPI_1_TX
	#define _MASK_INT_SPI_2					_MASK_INT_SPI_2_ERR|_MASK_INT_SPI_2_RX|_MASK_INT_SPI_2_TX
	#define _MASK_INT_SPI_3					_MASK_INT_SPI_3_ERR|_MASK_INT_SPI_3_RX|_MASK_INT_SPI_3_TX
	#define _MASK_INT_SPI_4					_MASK_INT_SPI_4_ERR|_MASK_INT_SPI_4_RX|_MASK_INT_SPI_4_TX
	#define _MASK_INT_I2C_1					_MASK_INT_I2C_1_COL|_MASK_INT_I2C_1_SLAVE|_MASK_INT_I2C_1_MASTER
	#define _MASK_INT_I2C_2					_MASK_INT_I2C_2_COL|_MASK_INT_I2C_2_SLAVE|_MASK_INT_I2C_2_MASTER
	#define _MASK_INT_I2C_3					_MASK_INT_I2C_3_COL|_MASK_INT_I2C_3_SLAVE|_MASK_INT_I2C_3_MASTER
	#define _MASK_INT_I2C_4					_MASK_INT_I2C_4_COL|_MASK_INT_I2C_4_SLAVE|_MASK_INT_I2C_4_MASTER
	#define _MASK_INT_I2C_5					_MASK_INT_I2C_5_COL|_MASK_INT_I2C_5_SLAVE|_MASK_INT_I2C_5_MASTER

#endif
// --------------------- //

