laurencedv/PIClib/lib/peripheral/pic32_interrupt.h
// -- Interrupts Positions -- //
#if CPU_FAMILY == PIC32MX1xx || CPU_FAMILY == PIC32MX2xx
//Individual positions
	#define _POS_INT_CORE_TIMER				0
	#define _POS_INT_CORE_SOFT_0				1
	#define _POS_INT_CORE_SOFT_1				2
	#define _POS_INT_EXT_INT_0				3
	#define _POS_INT_TIMER_1				4
	#define _POS_INT_INPUT_CAPTURE_1_ERR			5
	#define _POS_INT_INPUT_CAPTURE_1			6
	#define _POS_INT_OUTPUT_COMPARE_1			7
	#define _POS_INT_EXT_INT_1				8
	#define _POS_INT_TIMER_2				9
	#define _POS_INT_INPUT_CAPTURE_2_ERR			10
	#define _POS_INT_INPUT_CAPTURE_2			11
	#define _POS_INT_OUTPUT_COMPARE_2			12
	#define _POS_INT_EXT_INT_2				13
	#define _POS_INT_TIMER_3				14
	#define _POS_INT_INPUT_CAPTURE_3_ERR			15
	#define _POS_INT_INPUT_CAPTURE_3			16
	#define _POS_INT_OUTPUT_COMPARE_3			17
	#define _POS_INT_EXT_INT_3				18
	#define _POS_INT_TIMER_4				19
	#define _POS_INT_INPUT_CAPTURE_4_ERR			20
	#define _POS_INT_INPUT_CAPTURE_4			21
	#define _POS_INT_OUTPUT_COMPARE_4			22
	#define _POS_INT_EXT_INT_4				23
	#define _POS_INT_TIMER_5				24
	#define _POS_INT_INPUT_CAPTURE_5_ERR			25
	#define _POS_INT_INPUT_CAPTURE_5			26
	#define _POS_INT_OUTPUT_COMPARE_5			27
	#define _POS_INT_ADC_1					28
	#define _POS_INT_FAIL_SAFE_CLOCK_MON			29
	#define _POS_INT_RTCC					30
	#define _POS_INT_FLASH_CONTROL_EVENT			31
	#define _POS_INT_COMPARATOR_1				0
	#define _POS_INT_COMPARATOR_2				1
	#define _POS_INT_COMPARATOR_3				2
	#define _POS_INT_USB					3
	#define _POS_INT_SPI_1_ERR				4
	#define _POS_INT_SPI_1_RX				5
	#define _POS_INT_SPI_1_TX				6
	#define _POS_INT_UART_1_ERR				7
	#define _POS_INT_UART_1_RX				8
	#define _POS_INT_UART_1_TX				9
	#define _POS_INT_I2C_1_COL				10
	#define _POS_INT_I2C_1_SLAVE				11
	#define _POS_INT_I2C_1_MASTER				12
	#define _POS_INT_INPUT_CHANGE_PORT_A			13
	#define _POS_INT_INPUT_CHANGE_PORT_B			14
	#define _POS_INT_INPUT_CHANGE_PORT_C			15
	#define _POS_INT_PMP					16
	#define _POS_INT_PMP_ERR				17
	#define _POS_INT_SPI_2_ERR				18
	#define _POS_INT_SPI_2_RX				19
	#define _POS_INT_SPI_2_TX				20
	#define _POS_INT_UART_2_ERR				21
	#define _POS_INT_UART_2_RX				22
	#define _POS_INT_UART_2_TX				23
	#define _POS_INT_I2C_2_COL				24
	#define _POS_INT_I2C_2_SLAVE				25
	#define _POS_INT_I2C_2_MASTER				26
	#define _POS_INT_CTMU					27
	#define _POS_INT_DMA_0					28
	#define _POS_INT_DMA_1					29
	#define _POS_INT_DMA_2					30
	#define _POS_INT_DMA_3					31

//Group positions
	#define _POS_INT_TIMER_23				_POS_INT_TIMER_2
	#define _POS_INT_TIMER_45				_POS_INT_TIMER_4
	#define _POS_INT_INPUT_CHANGE				_POS_INT_INPUT_CHANGE_PORT_A
	#define _POS_INT_UART_1					_POS_INT_UART_1_ERR
	#define _POS_INT_UART_2					_POS_INT_UART_2_ERR
	#define _POS_INT_SPI_1					_POS_INT_SPI_1_ERR
	#define _POS_INT_SPI_2					_POS_INT_SPI_2_ERR
	#define _POS_INT_I2C_1					_POS_INT_I2C_1_COL
	#define _POS_INT_I2C_2					_POS_INT_I2C_2_COL

#elif CPU_FAMILY == PIC32MX3xx || CPU_FAMILY == PIC32MX4xx
//Individual positions
	#define _POS_INT_CORE_TIMER				0
	#define _POS_INT_CORE_SOFT_0				1
	#define _POS_INT_CORE_SOFT_1				2
	#define _POS_INT_EXT_INT_0				3
	#define _POS_INT_TIMER_1				4
	#define _POS_INT_INPUT_CAPTURE_1			5
	#define _POS_INT_OUTPUT_COMPARE_1			6
	#define _POS_INT_EXT_INT_1				7
	#define _POS_INT_TIMER_2				8
	#define _POS_INT_INPUT_CAPTURE_2			9
	#define _POS_INT_OUTPUT_COMPARE_2			10
	#define _POS_INT_EXT_INT_2				11
	#define _POS_INT_TIMER_3				12
	#define _POS_INT_INPUT_CAPTURE_3			13
	#define _POS_INT_OUTPUT_COMPARE_3			14
	#define _POS_INT_EXT_INT_3				15
	#define _POS_INT_TIMER_4				16
	#define _POS_INT_INPUT_CAPTURE_4			17
	#define _POS_INT_OUTPUT_COMPARE_4			18
	#define _POS_INT_EXT_INT_4				19
	#define _POS_INT_TIMER_5				20
	#define _POS_INT_INPUT_CAPTURE_5			21
	#define _POS_INT_OUTPUT_COMPARE_5			22
	#define _POS_INT_SPI_1_ERR				23
	#define _POS_INT_SPI_1_RX				24
	#define _POS_INT_SPI_1_TX				25
	#define _POS_INT_UART_1_ERR				26
	#define _POS_INT_UART_1_RX				27
	#define _POS_INT_UART_1_TX				28
	#define _POS_INT_I2C_1_COL				29
	#define _POS_INT_I2C_1_SLAVE				30
	#define _POS_INT_I2C_1_MASTER				31
	#define _POS_INT_INPUT_CHANGE				0
	#define _POS_INT_ADC_1					1
	#define _POS_INT_PMP					2
	#define _POS_INT_COMPARATOR_1				3
	#define _POS_INT_COMPARATOR_2				4
	#define _POS_INT_SPI_2_ERR				5
	#define _POS_INT_SPI_2_RX				6
	#define _POS_INT_SPI_2_TX				7
	#define _POS_INT_UART_2_ERR				8
	#define _POS_INT_UART_2_RX				9
	#define _POS_INT_UART_2_TX				10
	#define _POS_INT_I2C_2_COL				11
	#define _POS_INT_I2C_2_SLAVE				12
	#define _POS_INT_I2C_2_MASTER				13
	#define _POS_INT_FAIL_SAFE_CLOCK_MON			14
	#define _POS_INT_RTCC					15
	#define _POS_INT_DMA_0					16
	#define _POS_INT_DMA_1					17
	#define _POS_INT_DMA_2					18
	#define _POS_INT_DMA_3					19
	#define _POS_INT_FLASH_CONTROL_EVENT			24
	#define _POS_INT_USB					25

//Group mask
	#define _POS_INT_TIMER_23				_POS_INT_TIMER_2
	#define _POS_INT_TIMER_45				_POS_INT_TIMER_4
	#define _POS_INT_UART_1					_POS_INT_UART_1_ERR
	#define _POS_INT_UART_2					_POS_INT_UART_2_ERR
	#define _POS_INT_SPI_1					_POS_INT_SPI_1_ERR
	#define _POS_INT_SPI_2					_POS_INT_SPI_2_ERR
	#define _POS_INT_I2C_1					_POS_INT_I2C_1_COL
	#define _POS_INT_I2C_2					_POS_INT_I2C_2_COL

#elif CPU_FAMILY == PIC32MX5xxH || CPU_FAMILY == PIC32MX5xxL || CPU_FAMILY == PIC32MX6xx || CPU_FAMILY == PIC32MX7xx
//Individual positions
	#define _POS_INT_CORE_TIMER				0
	#define _POS_INT_CORE_SOFT_0				1
	#define _POS_INT_CORE_SOFT_1				2
	#define _POS_INT_EXT_INT_0				3
	#define _POS_INT_TIMER_1				4
	#define _POS_INT_INPUT_CAPTURE_1			5
	#define _POS_INT_OUTPUT_COMPARE_1			6
	#define _POS_INT_EXT_INT_1				7
	#define _POS_INT_TIMER_2				8
	#define _POS_INT_INPUT_CAPTURE_2			9
	#define _POS_INT_OUTPUT_COMPARE_2			10
	#define _POS_INT_EXT_INT_2				11
	#define _POS_INT_TIMER_3				12
	#define _POS_INT_INPUT_CAPTURE_3			13
	#define _POS_INT_OUTPUT_COMPARE_3			14
	#define _POS_INT_EXT_INT_3				15
	#define _POS_INT_TIMER_4				16
	#define _POS_INT_INPUT_CAPTURE_4			17
	#define _POS_INT_OUTPUT_COMPARE_4			18
	#define _POS_INT_EXT_INT_4				19
	#define _POS_INT_TIMER_5				20
	#define _POS_INT_INPUT_CAPTURE_5			21
	#define _POS_INT_OUTPUT_COMPARE_5			22
	#define _POS_INT_SPI_1_ERR				23
	#define _POS_INT_SPI_1_RX				24
	#define _POS_INT_SPI_1_TX				25
	#define _POS_INT_UART_1_ERR				26
	#define _POS_INT_UART_1_RX				27
	#define _POS_INT_UART_1_TX				28
	#define _POS_INT_SPI_3_ERR				26
	#define _POS_INT_SPI_3_RX				27
	#define _POS_INT_SPI_3_TX				28
	#define _POS_INT_I2C_3_COL				26
	#define _POS_INT_I2C_3_SLAVE				27
	#define _POS_INT_I2C_3_MASTER				28
	#define _POS_INT_I2C_1_COL				29
	#define _POS_INT_I2C_1_SLAVE				30
	#define _POS_INT_I2C_1_MASTER				31
	#define _POS_INT_INPUT_CHANGE				0
	#define _POS_INT_ADC_1					1
	#define _POS_INT_PMP					2
	#define _POS_INT_COMPARATOR_1				3
	#define _POS_INT_COMPARATOR_2				4
	#define _POS_INT_UART_3_ERR				5
	#define _POS_INT_UART_3_RX				6
	#define _POS_INT_UART_3_TX				7
	#define _POS_INT_SPI_2_ERR				5
	#define _POS_INT_SPI_2_RX				6
	#define _POS_INT_SPI_2_TX				7
	#define _POS_INT_I2C_4_COL				5
	#define _POS_INT_I2C_4_SLAVE				6
	#define _POS_INT_I2C_4_MASTER				7
	#define _POS_INT_UART_2_ERR				8
	#define _POS_INT_UART_2_RX				9
	#define _POS_INT_UART_2_TX				10
	#define _POS_INT_SPI_4_ERR				8
	#define _POS_INT_SPI_4_RX				9
	#define _POS_INT_SPI_4_TX				10
	#define _POS_INT_I2C_5_COL				8
	#define _POS_INT_I2C_5_SLAVE				9
	#define _POS_INT_I2C_5_MASTER				10
	#define _POS_INT_I2C_2_COL				11
	#define _POS_INT_I2C_2_SLAVE				12
	#define _POS_INT_I2C_2_MASTER				13
	#define _POS_INT_FAIL_SAFE_CLOCK_MON			14
	#define _POS_INT_RTCC					15
	#define _POS_INT_DMA_0					16
	#define _POS_INT_DMA_1					17
	#define _POS_INT_DMA_2					18
	#define _POS_INT_DMA_3					19
	#define _POS_INT_DMA_4					20
	#define _POS_INT_DMA_5					21
	#define _POS_INT_DMA_6					22
	#define _POS_INT_DMA_7					23
	#define _POS_INT_FLASH_CONTROL_EVENT			24
	#define _POS_INT_USB					25
	#define _POS_INT_CAN_1					26
	#define _POS_INT_CAN_2					27
	#define _POS_INT_ETHERNET				28
	#define _POS_INT_INPUT_CAPTURE_1_ERR			29
	#define _POS_INT_INPUT_CAPTURE_2_ERR			30
	#define _POS_INT_INPUT_CAPTURE_3_ERR			31
	#define _POS_INT_INPUT_CAPTURE_4_ERR			0
	#define _POS_INT_INPUT_CAPTURE_5_ERR			1
	#define _POS_INT_PMP_ERR				2
	#define _POS_INT_UART_4_ERR				3
	#define _POS_INT_UART_4_RX				4
	#define _POS_INT_UART_4_TX				5
	#define _POS_INT_UART_6_ERR				6
	#define _POS_INT_UART_6_RX				7
	#define _POS_INT_UART_6_TX				8
	#define _POS_INT_UART_5_ERR				9
	#define _POS_INT_UART_5_RX				10
	#define _POS_INT_UART_5_TX				11

