laurencedv/PIClib/lib/peripheral/pic32_interrupt.h
//Group positions
	#define _POS_INT_TIMER_23				_POS_INT_TIMER_2
	#define _POS_INT_TIMER_45				_POS_INT_TIMER_4
	#define _POS_INT_UART_1					_POS_INT_UART_1_ERR
	#define _POS_INT_UART_2					_POS_INT_UART_2_ERR
	#define _POS_INT_UART_3					_POS_INT_UART_3_ERR
	#define _POS_INT_UART_4					_POS_INT_UART_4_ERR
	#define _POS_INT_UART_5					_POS_INT_UART_5_ERR
	#define _POS_INT_UART_6					_POS_INT_UART_6_ERR
	#define _POS_INT_SPI_1					_POS_INT_SPI_1_ERR
	#define _POS_INT_SPI_2					_POS_INT_SPI_2_ERR
	#define _POS_INT_SPI_3					_POS_INT_SPI_3_ERR
	#define _POS_INT_SPI_4					_POS_INT_SPI_4_ERR
	#define _POS_INT_I2C_1					_POS_INT_I2C_1_COL
	#define _POS_INT_I2C_2					_POS_INT_I2C_2_COL
	#define _POS_INT_I2C_3					_POS_INT_I2C_3_COL
	#define _POS_INT_I2C_4					_POS_INT_I2C_4_COL
	#define _POS_INT_I2C_5					_POS_INT_I2C_5_COL
#endif
// -------------------------- //

// -- Interrupts Registers -- //
#if CPU_FAMILY == PIC32MX1xx || CPU_FAMILY == PIC32MX2xx
//Individual registers
	#define _REG_INT_CORE_TIMER				0
	#define _REG_INT_CORE_SOFT_0				0
	#define _REG_INT_CORE_SOFT_1				0
	#define _REG_INT_EXT_INT_0				0
	#define _REG_INT_TIMER_1				0
	#define _REG_INT_INPUT_CAPTURE_1_ERR			0
	#define _REG_INT_INPUT_CAPTURE_1			0
	#define _REG_INT_OUTPUT_COMPARE_1			0
	#define _REG_INT_EXT_INT_1				0
	#define _REG_INT_TIMER_2				0
	#define _REG_INT_INPUT_CAPTURE_2_ERR			0
	#define _REG_INT_INPUT_CAPTURE_2			0
	#define _REG_INT_OUTPUT_COMPARE_2			0
	#define _REG_INT_EXT_INT_2				0
	#define _REG_INT_TIMER_3				0
	#define _REG_INT_INPUT_CAPTURE_3_ERR			0
	#define _REG_INT_INPUT_CAPTURE_3			0
	#define _REG_INT_OUTPUT_COMPARE_3			0
	#define _REG_INT_EXT_INT_3				0
	#define _REG_INT_TIMER_4				0
	#define _REG_INT_INPUT_CAPTURE_4_ERR			0
	#define _REG_INT_INPUT_CAPTURE_4			0
	#define _REG_INT_OUTPUT_COMPARE_4			0
	#define _REG_INT_EXT_INT_4				0
	#define _REG_INT_TIMER_5				0
	#define _REG_INT_INPUT_CAPTURE_5_ERR			0
	#define _REG_INT_INPUT_CAPTURE_5			0
	#define _REG_INT_OUTPUT_COMPARE_5			0
	#define _REG_INT_ADC_1					0
	#define _REG_INT_FAIL_SAFE_CLOCK_MON			0
	#define _REG_INT_RTCC					0
	#define _REG_INT_FLASH_CONTROL_EVENT			0
	#define _REG_INT_COMPARATOR_1				1
	#define _REG_INT_COMPARATOR_2				1
	#define _REG_INT_COMPARATOR_3				1
	#define _REG_INT_USB					1
	#define _REG_INT_SPI_1_ERR				1
	#define _REG_INT_SPI_1_RX				1
	#define _REG_INT_SPI_1_TX				1
	#define _REG_INT_UART_1_ERR				1
	#define _REG_INT_UART_1_RX				1
	#define _REG_INT_UART_1_TX				1
	#define _REG_INT_I2C_1_COL				1
	#define _REG_INT_I2C_1_SLAVE				1
	#define _REG_INT_I2C_1_MASTER				1
	#define _REG_INT_INPUT_CHANGE_PORT_A			1
	#define _REG_INT_INPUT_CHANGE_PORT_B			1
	#define _REG_INT_INPUT_CHANGE_PORT_C			1
	#define _REG_INT_PMP					1
	#define _REG_INT_PMP_ERR				1
	#define _REG_INT_SPI_2_ERR				1
	#define _REG_INT_SPI_2_RX				1
	#define _REG_INT_SPI_2_TX				1
	#define _REG_INT_UART_2_ERR				1
	#define _REG_INT_UART_2_RX				1
	#define _REG_INT_UART_2_TX				1
	#define _REG_INT_I2C_2_COL				1
	#define _REG_INT_I2C_2_SLAVE				1
	#define _REG_INT_I2C_2_MASTER				1
	#define _REG_INT_CTMU					1
	#define _REG_INT_DMA_0					1
	#define _REG_INT_DMA_1					1
	#define _REG_INT_DMA_2					1
	#define _REG_INT_DMA_3					1

//Group registers
	#define _REG_INT_TIMER_23				0
	#define _REG_INT_TIMER_45				0
	#define _REG_INT_INPUT_CHANGE				1
	#define _REG_INT_UART_1					1
	#define _REG_INT_UART_2					1
	#define _REG_INT_SPI_1					1
	#define _REG_INT_SPI_2					1
	#define _REG_INT_I2C_1					1
	#define _REG_INT_I2C_2					1

#elif CPU_FAMILY == PIC32MX3xx || CPU_FAMILY == PIC32MX4xx
//Individual registers
	#define _REG_INT_CORE_TIMER				0
	#define _REG_INT_CORE_SOFT_0				0
	#define _REG_INT_CORE_SOFT_1				0
	#define _REG_INT_EXT_INT_0				0
	#define _REG_INT_TIMER_1				0
	#define _REG_INT_INPUT_CAPTURE_1			0
	#define _REG_INT_OUTPUT_COMPARE_1			0
	#define _REG_INT_EXT_INT_1				0
	#define _REG_INT_TIMER_2				0
	#define _REG_INT_INPUT_CAPTURE_2			0
	#define _REG_INT_OUTPUT_COMPARE_2			0
	#define _REG_INT_EXT_INT_2				0
	#define _REG_INT_TIMER_3				0
	#define _REG_INT_INPUT_CAPTURE_3			0
	#define _REG_INT_OUTPUT_COMPARE_3			0
	#define _REG_INT_EXT_INT_3				0
	#define _REG_INT_TIMER_4				0
	#define _REG_INT_INPUT_CAPTURE_4			0
	#define _REG_INT_OUTPUT_COMPARE_4			0
	#define _REG_INT_EXT_INT_4				0
	#define _REG_INT_TIMER_5				0
	#define _REG_INT_INPUT_CAPTURE_5			0
	#define _REG_INT_OUTPUT_COMPARE_5			0
	#define _REG_INT_SPI_1_ERR				0
	#define _REG_INT_SPI_1_RX				0
	#define _REG_INT_SPI_1_TX				0
	#define _REG_INT_UART_1_ERR				0
	#define _REG_INT_UART_1_RX				0
	#define _REG_INT_UART_1_TX				0
	#define _REG_INT_I2C_1_COL				0
	#define _REG_INT_I2C_1_SLAVE				0
	#define _REG_INT_I2C_1_MASTER				0
	#define _REG_INT_INPUT_CHANGE				1
	#define _REG_INT_ADC_1					1
	#define _REG_INT_PMP					1
	#define _REG_INT_COMPARATOR_1				1
	#define _REG_INT_COMPARATOR_2				1
	#define _REG_INT_SPI_2_ERR				1
	#define _REG_INT_SPI_2_RX				1
	#define _REG_INT_SPI_2_TX				1
	#define _REG_INT_UART_2_ERR				1
	#define _REG_INT_UART_2_RX				1
	#define _REG_INT_UART_2_TX				1
	#define _REG_INT_I2C_2_COL				1
	#define _REG_INT_I2C_2_SLAVE				1
	#define _REG_INT_I2C_2_MASTER				1
	#define _REG_INT_FAIL_SAFE_CLOCK_MON			1
	#define _REG_INT_RTCC					1
	#define _REG_INT_DMA_0					1
	#define _REG_INT_DMA_1					1
	#define _REG_INT_DMA_2					1
	#define _REG_INT_DMA_3					1
	#define _REG_INT_FLASH_CONTROL_EVENT			1
	#define _REG_INT_USB					1

//Group registers
	#define _REG_INT_TIMER_23				_REG_INT_TIMER_2
	#define _REG_INT_TIMER_45				_REG_INT_TIMER_4
	#define _REG_INT_UART_1					_REG_INT_UART_1_ERR
	#define _REG_INT_UART_2					_REG_INT_UART_2_ERR
	#define _REG_INT_SPI_1					_REG_INT_SPI_1_ERR
	#define _REG_INT_SPI_2					_REG_INT_SPI_2_ERR
	#define _REG_INT_I2C_1					_REG_INT_I2C_1_COL
	#define _REG_INT_I2C_2					_REG_INT_I2C_2_COL

#elif CPU_FAMILY == PIC32MX5xxH || CPU_FAMILY == PIC32MX5xxL || CPU_FAMILY == PIC32MX6xx || CPU_FAMILY == PIC32MX7xx
//Individual registers
	#define _REG_INT_CORE_TIMER				0
	#define _REG_INT_CORE_SOFT_0				0
	#define _REG_INT_CORE_SOFT_1				0
	#define _REG_INT_EXT_INT_0				0
	#define _REG_INT_TIMER_1				0
	#define _REG_INT_INPUT_CAPTURE_1			0
	#define _REG_INT_OUTPUT_COMPARE_1			0
	#define _REG_INT_EXT_INT_1				0
	#define _REG_INT_TIMER_2				0
	#define _REG_INT_INPUT_CAPTURE_2			0
	#define _REG_INT_OUTPUT_COMPARE_2			0
	#define _REG_INT_EXT_INT_2				0
	#define _REG_INT_TIMER_3				0
	#define _REG_INT_INPUT_CAPTURE_3			0
	#define _REG_INT_OUTPUT_COMPARE_3			0
	#define _REG_INT_EXT_INT_3				0
	#define _REG_INT_TIMER_4				0
	#define _REG_INT_INPUT_CAPTURE_4			0
	#define _REG_INT_OUTPUT_COMPARE_4			0
	#define _REG_INT_EXT_INT_4				0
	#define _REG_INT_TIMER_5				0
	#define _REG_INT_INPUT_CAPTURE_5			0
	#define _REG_INT_OUTPUT_COMPARE_5			0
	#define _REG_INT_SPI_1_ERR				0
	#define _REG_INT_SPI_1_RX				0
	#define _REG_INT_SPI_1_TX				0
	#define _REG_INT_UART_1_ERR				0
	#define _REG_INT_UART_1_RX				0
	#define _REG_INT_UART_1_TX				0
	#define _REG_INT_SPI_3_ERR				0
	#define _REG_INT_SPI_3_RX				0
	#define _REG_INT_SPI_3_TX				0
	#define _REG_INT_I2C_3_COL				0
	#define _REG_INT_I2C_3_SLAVE				0
	#define _REG_INT_I2C_3_MASTER				0
	#define _REG_INT_I2C_1_COL				0
	#define _REG_INT_I2C_1_SLAVE				0
	#define _REG_INT_I2C_1_MASTER				0
	#define _REG_INT_INPUT_CHANGE				1
	#define _REG_INT_ADC_1					1
	#define _REG_INT_PMP					1
	#define _REG_INT_COMPARATOR_1				1
	#define _REG_INT_COMPARATOR_2				1
	#define _REG_INT_UART_3_ERR				1
	#define _REG_INT_UART_3_RX				1
	#define _REG_INT_UART_3_TX				1
	#define _REG_INT_SPI_2_ERR				1
	#define _REG_INT_SPI_2_RX				1
	#define _REG_INT_SPI_2_TX				1
	#define _REG_INT_I2C_4_COL				1
	#define _REG_INT_I2C_4_SLAVE				1
	#define _REG_INT_I2C_4_MASTER				1
	#define _REG_INT_UART_2_ERR				1
	#define _REG_INT_UART_2_RX				1
	#define _REG_INT_UART_2_TX				1
	#define _REG_INT_SPI_4_ERR				1
	#define _REG_INT_SPI_4_RX				1
	#define _REG_INT_SPI_4_TX				1
	#define _REG_INT_I2C_5_COL				1
	#define _REG_INT_I2C_5_SLAVE				1
	#define _REG_INT_I2C_5_MASTER				1
	#define _REG_INT_I2C_2_COL				1
	#define _REG_INT_I2C_2_SLAVE				1
	#define _REG_INT_I2C_2_MASTER				1
	#define _REG_INT_FAIL_SAFE_CLOCK_MON			1
	#define _REG_INT_RTCC					1
	#define _REG_INT_DMA_0					1
	#define _REG_INT_DMA_1					1
	#define _REG_INT_DMA_2					1
	#define _REG_INT_DMA_3					1
	#define _REG_INT_DMA_4					1
	#define _REG_INT_DMA_5					1
	#define _REG_INT_DMA_6					1
	#define _REG_INT_DMA_7					1
	#define _REG_INT_FLASH_CONTROL_EVENT			1
	#define _REG_INT_USB					1
	#define _REG_INT_CAN_1					1
	#define _REG_INT_CAN_2					1
	#define _REG_INT_ETHERNET				1
	#define _REG_INT_INPUT_CAPTURE_1_ERR			1
	#define _REG_INT_INPUT_CAPTURE_2_ERR			1
	#define _REG_INT_INPUT_CAPTURE_3_ERR			1
	#define _REG_INT_INPUT_CAPTURE_4_ERR			2
	#define _REG_INT_INPUT_CAPTURE_5_ERR			2
	#define _REG_INT_PMP_ERR				2
	#define _REG_INT_UART_4_ERR				2
	#define _REG_INT_UART_4_RX				2
	#define _REG_INT_UART_4_TX				2
	#define _REG_INT_UART_6_ERR				2
	#define _REG_INT_UART_6_RX				2
	#define _REG_INT_UART_6_TX				2
	#define _REG_INT_UART_5_ERR				2
	#define _REG_INT_UART_5_RX				2
	#define _REG_INT_UART_5_TX				2

//Group registers
	#define _REG_INT_TIMER_23				_REG_INT_TIMER_2
	#define _REG_INT_TIMER_45				_REG_INT_TIMER_4
	#define _REG_INT_UART_1					_REG_INT_UART_1_ERR
	#define _REG_INT_UART_2					_REG_INT_UART_2_ERR
	#define _REG_INT_UART_3					_REG_INT_UART_3_ERR
	#define _REG_INT_UART_4					_REG_INT_UART_4_ERR
	#define _REG_INT_UART_5					_REG_INT_UART_5_ERR
	#define _REG_INT_UART_6					_REG_INT_UART_6_ERR
	#define _REG_INT_SPI_1					_REG_INT_SPI_1_ERR
	#define _REG_INT_SPI_2					_REG_INT_SPI_2_ERR
	#define _REG_INT_SPI_3					_REG_INT_SPI_3_ERR
	#define _REG_INT_SPI_4					_REG_INT_SPI_4_ERR
	#define _REG_INT_I2C_1					_REG_INT_I2C_1_COL
	#define _REG_INT_I2C_2					_REG_INT_I2C_2_COL
	#define _REG_INT_I2C_3					_REG_INT_I2C_3_COL
	#define _REG_INT_I2C_4					_REG_INT_I2C_4_COL
	#define _REG_INT_I2C_5					_REG_INT_I2C_5_COL
#endif
// -------------------------- //
// ############################################## //


// ############# Internal Functions ############# //
/**
* \fn		void _intSetReg(U32 * regPtr, tIntIRQ intIRQSource, U8 state)
* @brief	Write access to a interrupt register
* @note		INTERNAL FUNCTION Do not use directly!!!
* @arg		U32 * regPtr			Pointer to the register being written
* @arg		tIntIRQ intIRQSource		Which interrupt to set
* @arg		U8 state			State to set the bit
* @return	nothing
*/
void _intSetReg(volatile U32 * regPtr, tIntIRQ intIRQSource, U8 state);

/**
* \fn		U8 _intGetReg(U32 * regPtr, tIntIRQ intIRQSource)
* @brief	Read access to a interrupt register
* @note		INTERNAL FUNCTION Do not use directly!!!
* @arg		U32 * regPtr			Pointer to the register being written
* @arg		tIntIRQ intIRQSource		Which interrupt to set
* @return	U8 state			State to set the bit
*/
U8 _intGetReg(volatile U32 * regPtr, tIntIRQ intIRQSource);
// ############################################## //

#endif
